{"pages":[{"text":"#About me Hello! I'm Stevie, a Belgian student at the University of Leuven. This page serves as a brief biographical introduction, as well as explaining the aims of this blog. Having formerly attained a BA in Applied Informatics, 1 I'm currently pursuing a degree in Japanology at the University of Leuven; a radical switch, but one through which I'm able to combine both my strong interest in humanities as in the country of Japan. Growing up in a poor Antwerp neighbourhood as the only kid at school of a supposed Belgian origin, and later onwards as a technical school (TSO) student, I have seen, and been confronted with, all kinds of discrimination. This has led me to an interest in (and questioning of) the notion of national identity and nationalism itself, as well as more broadly, an interest in the fields of sociology and politics. That aside, I've become particularly drawn to Digital Humanities, a domain that feels, through several years of fostering technical skills, right at home as a perfect synthesis of both my former and current studies. On a personal note, I'm fairly passionate about music. I've spent the better part of my life taking piano classes or playing in bands, and despite an ever shrinking lack of free time, enjoy spending most of it on composing. This blog serves as a platform for random musings on personal subjects (I also hope to occasionally plug whatever music I'm working on!) as well as a means to hone my linguistic proficiency. That aside, I hope I'll be able to provide some assistence to my fellow students (or anyone interested) on technical aspects related to the academic studies. #This blog I host my blog, built on the extremely versatile and lightweight Pelican framework, on github pages, using a custom made jinja2 template based on the nest and plumage templates. As my workflow involves writing most of my papers in markdown syntaxis anyway (I'm trying to incorporate a \"less is more\" attitude wherever possible), Pelican turns out to be both a good match and way for me to maintain my webdesign skills. AP University College, 2011 - 2014 ↩","url":"http://steviepoppe.github.io/about","title":"About Me","tags":"pages"},{"text":"This page contains links and files that have proven to be particularly useful for myself and might be of use for those with similar interests. I'll update this spot as I encounter more tools or pages I feel are worthy of mention. Useful Links General Anki : Free, opensource, multiplatform (smartphones included) flashcard application with powerful SRS 1 algorithm. Especially vital for language acquisition and probably the single most important tool for efficient memorisation. Language Japanese Rikaisama : a Firefox 2 extension on Rikaichan , a pop-up dictionary and a digital minded Japanese learner's best friend. Rikaisama allows additional audio playback anki integration. I've written a blog on how to do this. Animelon : for all you ‘learn Japanese through Anime' kids out there! Reminiscent of the classic Erin's Challenge videos: watch various popular anime with japanese subtitles in kanji/kana/romaji and a script with integrated dictionary as sidebar. Perfect in combination with rikaisama as well. Waran Jiten : a Japanese-Dutch dictionary courtesy of Leuven University. Has a dutch rikai addon. Tangorin : my favorite online Japanese dictionary, has an excellent Kanji dictionary as well. Sourceforge : contains a wide variety of software developed by fellow Japanese learners. Some, such as Jnovelformatter and Japanese Text Analysis Tool (both which I've discussed here and here ) are particularly noteworthy, others not so much. KULeuven Japanology : the Leuven University Japanology homepage. Sanskrit spokensanskrit : the only decent online Sanskrit dictionary out there. Lexilogos : multilingual web keyboard that beats learning to type devanagari on a latin-script keyboard. Files Anki I use Anki to compliment my other study methods for nearly all my classes. These are a bunch of ankisets I made I feel are stand-alone enough to be useful to new students of these classes as well. Inleiding tot de Europese Literatuur na 1750 Download : Europese Literatuur A full set to accompany the textbook ‘ Literaire Verbeelding 2 ‘ 3 : contains important dates and summaries of all artists and their discussed works (in Dutch), sorted by period (from Romanticism till Postmodernism). Kanji 2 Download : Kanji 2 Kanji Vocab 2 Two sets on the compulsory kanji and vocabulary for kanji/goi classes in the 2nd year of Japanology, as seen in our handbook 4 lessons 1 - 20. They're tagged by chapter and contain respectively strokeorder, radicals, definitions, and different readings for the Kanji set, and example sentences in cloze deletion 5 for vocab, both in recognition and reproduction form. They use the KanjiStrokeOrders 6 font and display hidden hiragana on touch/hover. Spaced Repetition System : a method of studying optimally by repeating items over gradually increasing periods. Cards are calculated to appear shortly before the item slips one's mind. ↩ Chrome users can use Rikaikun instead. ↩ Ghesquiere, R. 2006. Literaire verbeelding 2: een geschiedenis van de Europese literatuur en cultuur vanaf 1750. Leuven: Acco ↩ Japanese for International/Graduate Students vol.5: Kanji and Vocabulary（稲村真理子. 2007. 大学・大学院留学生の日本語. 5(漢字・語彙編) 5(漢字・語彙編). 東京: アルク） ↩ cloze deletion test : an exercise in which one fills in portions of the text left blank, based on the context of the text. ↩ Available for free under a BSD style license at http://www.nihilist.org.uk/ . ↩","url":"http://steviepoppe.github.io/resources","title":"Resources","tags":"pages"}]}