{"pages":[{"title":"About","text":"#About me Hello! I'm Stevie, a Belgian student at the University of Leuven. This page serves as a brief biographical introduction, as well as explaining the aims of this blog. Having formerly attained a BA in Applied Informatics, 1 I'm currently pursuing a degree in Japanology at the University of Leuven; a radical switch, but one through which I'm able to combine both my strong interest in humanities as in the country of Japan. Growing up in a poor Antwerp neighbourhood as the only kid at school of a supposed Belgian origin, and later onwards as a technical school (TSO) student, I have seen, and been confronted with, all kinds of discrimination. This has led me to an interest in (and questioning of) the notion of national identity and nationalism itself, as well as more broadly, an interest in the fields of sociology and politics. That aside, I've become particularly drawn to Digital Humanities, a domain that feels, through several years of fostering technical skills, right at home as a perfect synthesis of both my former and current studies. On a personal note, I'm fairly passionate about music. I've spent the better part of my life taking piano classes or playing in bands, and despite an ever shrinking lack of free time, enjoy spending most of it on composing. This blog serves as a platform for random musings on personal subjects (usually on languages, Japan or my studies in general, but I hope to occasionally plug whatever music I'm working on as well!) as well as a means to hone my linguistic proficiency. That aside, I hope I'll be able to provide some assistence to my fellow students (or anyone interested) on technical aspects related to the academic studies. #This blog I host my blog, built on the versatile and lightweight Pelican framework, on GitHub Pages , using a custom made theme based on the plumage template. As my workflow involves writing most of my papers in markdown syntax anyway (I'm trying to incorporate a \"less is more\" attitude wherever possible), Pelican turns out to be both a good match and way for me to maintain my webdesign skills.","url":"https://steviepoppe.net/about/","tags":"pages"},{"title":"Resources","text":"This page contains links and files that have proven to be particularly useful for myself and might be of use for those with similar interests. I'll update this spot as I encounter more tools or pages I feel are worthy of mention. Useful Links General Anki : Free, opensource, multiplatform (smartphones included) flashcard application with powerful SRS 1 algorithm. Especially vital for language acquisition and probably the single most important tool for efficient memorisation. Feedly : My RSS reader of choice. Free, intuitive interface, supports all the major platforms and browsers, and syncs your articles. A must have if you're following several blogs or newspapers on a daily basis. Feel free to add me on your feed. Language Japanese Rikaisama : a Firefox 2 extension on Rikaichan , a pop-up dictionary and a digital minded Japanese learner's best friend. Rikaisama allows additional audio playback anki integration. I've written a blog on how to do this. Animelon : for all you ‘learn Japanese through Anime' kids out there! Reminiscent of the classic Erin's Challenge videos: watch various popular anime with japanese subtitles in kanji/kana/romaji and a script with integrated dictionary as sidebar. Perfect in combination with rikaisama as well. Waran Jiten : a Japanese-Dutch dictionary courtesy of Leuven University. Has a dutch rikai addon. Tangorin : my favorite online Japanese dictionary, has an excellent Kanji dictionary as well. Sourceforge : contains a wide variety of software developed by fellow Japanese learners. Some, such as Jnovelformatter , Japanese Text Analysis Tool or OCR Manga Reader are particularly noteworthy, others not so much. KULeuven Japanology : the Leuven University Japanology homepage. Sanskrit spokensanskrit : the only decent online Sanskrit dictionary out there. Lexilogos : multilingual web keyboard that beats learning to type devanagari on a latin-script keyboard. Files Anki I use Anki to complement my other study methods for nearly all my classes. These are a bunch of ankisets I made I feel are stand-alone enough to be useful to new students of these classes as well. Inleiding tot de Europese Literatuur na 1750 Download : Europese Literatuur A full set to accompany the textbook ‘ Literaire Verbeelding 2 ‘ 3 : contains important dates and summaries of all artists and their discussed works (in Dutch), sorted by period (from Romanticism till Postmodernism). Kanji 2 Download : Kanji 2 Kanji Vocab 2 Two sets on the compulsory kanji and vocabulary for kanji/goi classes in the 2nd year of Japanology, as seen in our handbook 4 lessons 1 - 20. They're tagged by chapter and contain respectively strokeorder, radicals, definitions, and different readings for the Kanji set, and example sentences in cloze deletion 5 for vocab, both in recognition and reproduction form. They use the KanjiStrokeOrders 6 font and display hidden hiragana on touch/hover. I recommend doing these on a handheld device to practice writing and stroke order using the touchscreen. Spaced Repetition System : a method of studying optimally by repeating items over gradually increasing periods. Cards are calculated to appear shortly before the item slips one's mind. ↩ Chrome users can use Rikaikun instead. ↩ Ghesquiere, R. 2006. Literaire verbeelding 2: een geschiedenis van de Europese literatuur en cultuur vanaf 1750. Leuven: Acco ↩ Japanese for International/Graduate Students vol.5: Kanji and Vocabulary（稲村真理子. 2007. 大学・大学院留学生の日本語. 5(漢字・語彙編) 5(漢字・語彙編). 東京: アルク） ↩ cloze deletion test : an exercise in which one fills in portions of the text left blank, based on the context of the text. ↩ Available for free under a BSD style license at http://www.nihilist.org.uk/ . ↩","url":"https://steviepoppe.net/resources/","tags":"pages"},{"title":"Visiting a Japanese Elementary School - An (Awkward) Experience to Remember","text":"Earlier this year I, alongside several other second year Japanology students, participated in a small \"tell an interesting story\" speech contest through our university. Earlier this week we were informed the videorecordings of these had been uploaded on the contest's website and were available for all to watch 1 . My story is a classic \"awkward Japanese language mix-up\" anecdote on a visit to a Japanese elementary school in Brussels, which I'll touch upon in this post, along embedding the video. (日本の方、あまりよくないんですけど、もしよかったら見てみてくださいね！) The Video This video, along with my participation entry, is available at speech-data.jp . The story This story really isn't that interesting and a bit embarassing, but here goes anyway! As second year students Japanology, our class participated in an excursion to a Japanese elementary school in Brussels: a fun opportunity to practice our language skills as well as have some fun playing games and learn about cultural differences and customs. The event even warranted a small post on the JSB 2 section on yahoo.co.jp ! In advance of this trip, we split our class in several groups, each preparing a presentation or activity related to our country. Several of the students in our group live in Antwerp, thus we thought it fun to hold a small presentation on the famous Antwerp folklore story of Druon Antigoon , an evil giant guarding a bridge and exacting an exorbitant toll of those wishing to cross. Failing to cross meant getting your hand chopped off and trown into the river 3 . A bit dark, but it worked well with a popular Belgian children's game we thought fit to teach them, and in addition, there's some really nice chocolate treats based on this tale we wanted to distribute afterwards. The game The game is a variation of a classic tag game called \" schipper, mag ik over varen? \" (Eng: \" Skipper, might I cross? \") and usually played on a school's courtyard or in a larger PE classroom. To play, the territory gets divided into two and the students line up on either side. One or two volunteers play the role of \"skipper\" or \"boatsman\" and line up in the middle (I drew a quick MS paint diagram below, don't judge). Each round, those on the border are expected to reach the other side. Those playing the role of skipper make up a rule that has to be upheld to attain passage. Rules to pass could be anything: those wearing glasses, those skipping on one leg, etc. Not being able to uphold these rules however means running past the skipper and not being caught: if you're tagged, you become a skipper as well. The more skippers, the more difficult the game becomes. The shame Me and a classmate played the role of skipper and did pretty well making up rules in Japanese. Near the end however, I noticed several of the remaining players wearing pink pants. \" I should definitely use this information for the next skipping rule \", I thought to myself. Now, the common word for pants in Japanese is ズボン ( zubon ), probably one of the first words we learned. Except during the heat of the moment I mixed this one up with another Japanese word very similar to the english \"pants\". The end … Long story short, in front of not just my own teachers but all of the Japanese staff present, I asked a bunch of 12 year old girls to pass if they wore pink パンツ ( pantsu ), a word commonly reserved for underwear. Hope I won't make that mistake again. 4 These videos can be found @ http://www.speech-data.jp/chotto/2015F_sub/ ↩ Short for the J apanese S chool of B russels, read more on this on Wikipedia ! ↩ Lucky for us Antwerp citizens, a young soldier named Brabo cuts of the giant's hand in return and casts it into the river, leaving us with some nice statues near the city square and an interesting story to tell tourists. Read more on this on Wikipedia ! ↩ I was confronted with a loud 「えええええええぇぇぇぇぇぇッ！！！」 coming from these girls' general direction. Everyone else looked particularly amused however, so that's something at least. ↩","url":"https://steviepoppe.net/blog/2016/08/visiting-a-japanese-elementary-school-an-awkward-experience-to-remember/","tags":"Personal"},{"title":"Pelican Plugin: CSS-only footnote pop-up","text":"Footnotes are a classic staple in any writer's toolbox and allows them to, in an unobtrusive way, citate sources or display additional information not directly related to the original argument. Yet I feel online footnotes, through the way they're often implemented imitating printed media footnotes, come over quite counterintuitive by forcing the interested reader to disrupt his reading flow, and by failing to make use of today's extensive webdesign posibilities. As I royally use footnotes in my markdown writing workflow 1 I figured I'd get acquainted with the Pelican documentation a bit and write a small unobtrusive CSS pop-up plugin to display these on hover for those devices that support it. 2 My solution is pretty rough and based on the way Python-Markdown parses markdown into HTML. As it's a quick ‘n dirty workaround untested with other parsers, I have no intention to further maintain this code so feel free to use it however you'd like. def content_object_init ( instance ): if instance . _content is not None : content = instance . _content soup = BeautifulSoup ( content , 'html.parser' ) if 'sup' in content : footnotes = soup . find ( class_ = \"footnote\" ) . find_all ( 'p' ) footnoteref = soup . find_all ( class_ = \"footnote-ref\" ) for index , item in enumerate ( footnotes ): footnoteref [ index ] . parent [ 'class' ] = 'popup_footnote' tag = soup . new_tag ( 'span' ) tag . append ( BeautifulSoup ( item . decode_contents (), 'html.parser' )) footnoteref [ index ] . insert_after ( tag ) instance . _content = soup . decode () def register (): signals . content_object_init . connect ( content_object_init ) For simplicity's sake I use the BeautifulSoup library to locate all footnote references and their respective footnotes. Then I loop through them and copy the contents of the footnote in a ‘popup_footnote' span I append to the footnote reference container. Styling is done in CSS. Below is my markup. I use left: 50%; transform: translate(-50%, 0); to center the absolute-positioned pop-up over the footnote reference. sup .popup_footnote span { text-align : justify ; z-index : 10 ; display : none ; padding : 5px ; line-height : 16px ; opacity : 0 . 9 ; border - radius : 4px ; box - shadow : 5px 5px 8px #D4D4D4 ; top : 10px ; left : 50% ; transform : translate ( -50% , 0 ); position : absolute ; width : 250px ; } sup .popup_footnote :hover span { display : inline ; color : #111 ; border : 1px solid #eaeaea ; background-color : #fffcfc ; } The downside to this CSS-only implementation (next to having double content in your markup) is that it fails to respond well to responsive design. Fixed-size pop-ups relative to the footnote pointer could result in a potential screen overflow. If this is an issue, the only alternative is using jquery and calculate the position of your reference relative to the window border and use this to calculate an ideal pop-up location. Of course if you're relying on the jquery library either way you might as well use that to copy the footnote on hover instead of above's solution. For such an example, I recommend ignorethecode.net's solution . The difficulty writing web-content with footnotes is distinguishing footnotes or direct links. I generally draw the line between source citation as footnote and useful information as direct link. ↩ Using :active to substitute the lack of proper hover on touch devices wouldn't be effective as these pop-ups display over anchors. A dirty solution would be to use media tags and keep display:none for mobile device widths, but with the blurring of lines between touch and mouse input devices lately this is not foolproof. ↩","url":"https://steviepoppe.net/blog/2016/08/pelican-plugin-css-only-footnote-pop-up/","tags":"Technical"},{"title":"Hello World - About This Blog","text":"I've been thinking on maintaining a blog for a while now and had already stacked up a pile of writings ready to post. A long summer break allowed me enough free time to sit down and get started on the technicalities; a process a bit more complicated as initially expected but worth it in the long run. This blog serves not as a tutorial on making one with Pelican (I'll get to that eventually), but as a brief log on my reasoning and thought process during creation. Blogplatform Deciding From the outset I tried to steer away from heavy content management systems such as Drupal or WordPress . They're easy to work with and take a lot of work of your hands, but a serverside database means too heavy a load for what's basically a smallscale personal blog, and several unnecessary security risks on top. 1 The tech-hipster in me opted for a DIY approach with full control over both content and design. Static blog framework wise there are several popular options, but as I'm more accustomed to the Python programming language through other applications, I ended up choosing for Pelican over the more widespread Ruby -based Jekyll . An added value of managing my blogs clientside and delivering small sized static pages is the ease of finding an appropriate host (I host my pages on GitHub Pages while serving larger files through Dropbox) and a seamless integration in my Markdown -based writing workflow. 2 Set-up The initial set-up is relatively simple, as installation and basic generation is done through command line, and content written in Markdown , AsciiDoc or reStructuredText 3 gets served as stand-alone pages or articles. There's a wide choice of existing templates , but further customization requires some working knowledge on webdesign as well as, preferably, on basic programming concepts (Pelican templates are created using the python-based Jinja2 , allowing for template logic and inheritance). Needless to say, hosting on GitHub Pages requires knowledge of Git , but that's really not a skill learned in vain as the concept of version control applies well to writing important papers too. Development Getting acquainted with these tools can be time consuming. Luckily Pelican's well documented , and there are plenty of tutorials out there, as well as hundreds of working examples hosted on GitHub available as reference (the backbone of my template is a heavily modified Plumage theme). I prefer a minimalistic layout easy on the eye, and steered clear of unnecessary clutter, but with the advent of visual blogging 4 I figured I'd integrate some graphical elements, such as article banners (that's the extent of it really, I'm not much of na artist), as visual content engages the reader more easily. One easily overlooked design problem is ensuring responsive webpages for the ever increasing mobile internet traffic 5 , but with easy support for Sass , or just using Twitter's Bootstrap framework, this comes pretty naturally. Finally, implementing additional features is pretty easy too. There's a wide range of existing plugins for features like searching, minifying assets, table of contents and comments (using the third-party Disqus blog hosting service). Hosting GitHub has allowed free hosting for static personal or projectsites on GitHub Pages for a while now. This boils down to creating a new repository with your username and GitHub url ( steviepoppe.github.io ) and hosting your pages there. I created an additional source branch to host all my sourcefiles, use ghp-import to place my output files in a seperate branch, and force push that to the master branch on GH Pages. 6 pelican content - o output - s publishconf . py && ghp - import output && git push - f origin gh - pages : master So far GitHub's SSL certificate only covers *.github.io domains, there's no support yet for custom domains. Thus as final step after having set up my custom domain, and as an additional security layer, I use CloudFare to secure part of the connection and enroll some further optimisations. Conclusion While further customization requires some technical experience (or at least the proper mindset), I believe the base set-up is easy enough for anyone to learn and allows for more control over your own content and a smoother workflow as you would have relying on big CMS systems. Any extra skills learned will definitely come in use as digital publishing, webdesign and working with Git or other forms of version control become more and more basic skills anyone should possess. In retrospect, Jekyll appears to be an easier option for beginners with it's widespread usage, but both Jekyll and Pelican achieve the same thing, so this is personal choice really. I'll end up writing a full step-by-step beginner's guide on setting up Pelican and hosting on GitHub Pages eventually, but for now I'll post several decent tutorials below. Further reading http://arunrocks.com/moving-blogs-to-pelican/ http://cyrille.rossant.net/pelican-github/ http://duncanlock.net/blog/2013/05/17/how-i-built-this-website-using-pelican-part-1-setup/ http://guizishanren.com/guide-to-set-up-github-page-and-pelican/ Burnett, Brett. 2015. \"Why Did We Migrate from Drupal to Jekyll?\" Text. The BHW Group. https://thebhwgroup.com/blog/jekyll-drupal-wordpress ↩ O'Nolan, John. 2015. \"The Ultimate Guide to Writing & Publishing with Markdown\". Ghost. https://blog.ghost.org/markdown/ ↩ All three are open, lightweight markup languages with a heavy focus on readability through seperation of content and layout layers. ↩ Fanguy, Will. 2016. \"The Amazing Evolution of Visual Storytelling: Blogging, Instagram, Snapchat, and the Future\". Business 2 Community. http://www.business2community.com/trends-news/amazing-evolution-visual-storytelling-blogging-instagram-snapchat-future-01557833 ↩ ‘ the amount of mobile traffic now accounts for more than half of total internet traffic ‘ \"Cisco Visual Networking Index: Global Mobile Data Traffic Forecast Update, 2015–2020 White Paper\". 2016. Cisco. http://www.cisco.com/c/en/us/solutions/collateral/service-provider/visual-networking-index-vni/mobile-white-paper-c11-520862.html ↩ I'm doing this manually through command line for now, but there's several automatisation options including using Travis-CI for the more hardcore blogger. ↩","url":"https://steviepoppe.net/blog/2016/08/hello-world-about-this-blog/","tags":"technical"}]}