{"pages":[{"tags":"pages","text":"#About me Hello! I'm Stevie, a Belgian undergraduate student at the University of Leuven. This page serves as a brief biographical introduction, as well as to explain the aims and origin of this blog. Having formerly attained a BA in Applied Informatics, 1 I'm currently pursuing a degree in Japan studies at the University of Leuven; a radical switch, but one through which I'm able to combine both my strong interest in humanities as in the country of Japan. Growing up in a poor Antwerp neighbourhood as the only kid at school of a supposed Belgian origin, and later onwards as a technical school (TSO) student, I have seen, and been confronted with, all kinds of discrimination. This has led me to an interest in (and questioning of) the notion of national identity and nationalism itself, as well as more broadly, an interest in the fields of sociology and politics. That aside, I've become particularly drawn to Digital Humanities, a domain that feels, through several years of fostering technical skills, right at home as a perfect synthesis of both my former and current studies. On a personal note, I'm fairly passionate about music. I've spent the better part of my life taking piano classes or playing in bands, and despite an ever shrinking lack of free time, enjoy spending most of it on composing. #About this blog I designed and built this blog from scratch using the lightweight, python-based Pelican as framework, and host my pages on GitHub's free web hosting service GitHub Pages . Since my workflow involves writing most of my content in markdown anyway, Pelican turns out to be both a good fit, and way for me to practice my webdesign skills. This blog serves simultaneously as a kind of portfolio, a place for technical experimentation, and as an outlet for random musings on personal subjects (usually on languages, Japan or my studies in general, although hopefully I'll get to occasionally plug whatever music I'm working on as well!). That aside, I hope I'll be able to provide some assistence to my fellow students (or anyone interested) on technical aspects related to the academic studies, or on Japanese Studies and the Japanese language in general. #About Onoreto Onoreto is the romanization of 己と, stylized as 己ト to resemble both the first two initials of my first name in Latin script, and the Korean Hangul 라. In the context of this blog as personal portfolio, 己 (onore) is a humble, rather old-fashioned way to refer to oneself, with と (to) implying a connection with what's coming next (\"Me and…\"). Alternatively, 己と is also an archaic Japanese expression signifying a spontanious, natural action, similar to みずから or おのずから.","title":"About","url":"https://steviepoppe.net/about/"},{"tags":"pages","text":"This page contains links and files that have proven to be particularly useful for myself and might be of use for those with similar interests. I'll update this spot as I encounter more tools or pages I feel are worthy of mention. Useful Links General Anki : Free, open-source, multiplatform (smartphones included) flashcard application with powerful SRS 1 algorithm. Especially vital for language acquisition and probably the single most important (digital) tool for efficient memorisation. Feedly : My RSS reader of choice. Free, intuitive interface, supports all the major platforms and browsers, and syncs your articles. A must have if you're following several blogs or newspapers on a daily basis. Feel free to add me on your feed. Language Japanese Rikaisama : a Firefox 2 extension on Rikaichan , a pop-up dictionary and a digital minded Japanese learner's best friend. Rikaisama allows additional audio playback anki integration. I've written a blog on how to do this. Animelon : for all you ‘learn Japanese through Anime' kids out there! Reminiscent of the classic Erin's Challenge videos: watch various popular anime with japanese subtitles in kanji/kana/romaji and a script with integrated dictionary as sidebar. Perfect in combination with rikaisama as well. Tangorin : my favorite online Japanese dictionary with tons of example sentences for each definition, and an excellent Kanji dictionary as well. Goo , Weblio and Sanseido provide good alternatives. Japan-Guide Penpals : a free, extremely active penpal community and fun way to both practice your Japanese and meet new people. A lot of Japanese members on the site want to improve their English, but if you write your own ad in Japanese you'll surely be contacted by Japanese members interested in cultural exchange, without using English. Waran Jiten : a Japanese-Dutch dictionary courtesy of Leuven University. Has a dutch rikai addon. Sourceforge : contains a wide variety of software developed by fellow Japanese learners. Some, such as Jnovelformatter , Japanese Text Analysis Tool or OCR Manga Reader are particularly noteworthy, others not so much. KULeuven Japanology : the Leuven University Japan Studies homepage. Korean Toktogi : a Korean-English popup dictionary similar to Rikaichan/sama/kun, available both for Firefox and Chrome. It's still a work-in-progress and not as polished as Rikai, but very usable nontheless. Naver Dictionary : Naver Corporation, the highly popular South Korean web-hub, has a fairly complete English-Korean dictionary as well as an Android application (requires internet). Sanskrit spokensanskrit : the only decent online Sanskrit dictionary out there. Lexilogos : multilingual web keyboard that beats learning to type devanagari on a latin-script keyboard. Files Anki I use Anki to complement my other study methods for nearly all my classes. These are a bunch of ankisets I made I feel are stand-alone enough to be useful to new students of these classes as well. Inleiding tot de Europese Literatuur na 1750 Download : Europese Literatuur (±26B) A full set to accompany the textbook ‘ Literaire Verbeelding 2 ‘ 3 : contains important dates and summaries of all artists and their discussed works (in Dutch), sorted by period (from Romanticism till Postmodernism). Kanji 1 & Kanji 2 Download : Kanji 1 Kanji Vocab 1 (±9MB each) Two sets on the compulsory kanji and vocabulary as seen in the kanji classes in the first year of Japan Studies at KU Leuven. They contain stroke order, definitions, and different readings, both in recognition and reproduction form. They use the KanjiStrokeOrders 4 font and display hidden hiragana on touch/hover. I recommend doing these on a handheld device to practice writing and stroke order using the touchscreen. Download : Kanji 2 Kanji Vocab 2 (±10MB each) Similar to the previous decks, two sets on the compulsory kanji and vocabulary for kanji/goi classes in the second year of Japanology, as seen in our handbook 5 lessons 1 - 20. They're tagged by chapter and contain respectively stroke order, radicals, definitions, and different readings for the Kanji set, and example sentences in cloze deletion 6 for vocab, both in recognition and reproduction form. Japanese Geography Download : Japanese Geography (±10MB) A modified Prefectures in Japan set, includes all Japanese regions and prefectures written in Kanji with furigana, and some extra maps. Anki Plug-in: Japanese Definitions for Korean Vocabulary Download : Remove Missing Audio References An Anki add-on, based on the Sanseido Definitions add-on, for adding Japanese translations of Korean vocabulary. It's primarily meant for Korean learners who're proficient in, or simultaneously learning, Japanese. I wrote a small tutorial for those new to Anki plug-ins. Anki Plug-in: Remove Missing Audio References Download : Remove Missing Audio References An Anki plug-in to be used in combination with a Rikaisama / Anki set-up as prescribed in this blog . Replaces or removes references to missing audio-files. Spaced Repetition System : a method of studying optimally by repeating items over gradually increasing periods. Cards are calculated to appear shortly before the item slips one's mind. ↩ Chrome users can use Rikaikun instead. ↩ Ghesquiere, R. 2006. Literaire verbeelding 2: een geschiedenis van de Europese literatuur en cultuur vanaf 1750. Leuven: Acco ↩ Available for free under a BSD style license at http://www.nihilist.org.uk/ . ↩ Japanese for International/Graduate Students vol.5: Kanji and Vocabulary （稲村真理子. 2007. 大学・大学院留学生の日本語. 5(漢字・語彙編) 5(漢字・語彙編). 東京: アルク） ↩ cloze deletion test : an exercise in which one fills in portions of the text left blank, based on the context of the text. ↩","title":"Resources","url":"https://steviepoppe.net/resources/"},{"tags":"Personal","text":"In order to up my Japanese pronunciation and become more fluent in Japanese text recitation, I've started somewhat of a new hobby: vlogging in Japanese. I'll (hopefully) publish weekly videos of myself narrating a newly posted newsarticle published on one of the mainstream Japanese newspaper websites, using a classic streaming-style set-up so any potential viewer can read along. If time permits, I've found it a fun exercise to try and translate the article as well as create subtitles (maybe I should try fansubbing some anime or drama one of these days, if I ever find the time, that is~). As this will become a weekly thing I won't be posting new blog-articles for every single video I do, but feel free to follow me on twitter or subscribe to my YT channel . For now it's limited to these narrations and (wip) music, but actually I've always wanted to do actual vlogging and/or podcasts so that should happen one day, probably when I'm studying abroad. Videos Week 5: トランプ氏、 犯罪歴 ( はんざいれき ) ある 移民 ( いみん ) を 強制送還 ( きょうせいそうかん ) 最大300万人}} This time I'm reading a Nikkei article on Trump's first public interview since his election as President of the USA. The original article can be found on Sankei News ( トランプ氏、犯罪歴ある移民を強制送還 最大300万人 ). (14/11/16) Week 4: トヨタの 電気自動車 ( でんきじどうしゃ ) My fourth reading is on a Toyota press-release regarding its policy on electrical vehicles. The original article can be found on Sankei News ( トヨタ、電気自動車を量産 平成３２年までに本格参入…バッテリー性能向上で走行距離改善 ). (08/11/16) Week 3: 渋谷 ( しぶや ) のハロウィーン This week's newspaper article is a report on the pre- Halloween festivities around the shopping districts in Shibuya, Tokyo. The original article can be found on Sankei News ( 「安倍マリオ」効果か？ スーパーマリオ仮装売れ行き好調 週末の渋谷ルポ ). As usual I've added subtitles in CC. (30/10/16) (not sure if that's a bad angle or if I should really lose some weight soon…) Week 2: くまモン My second vlog is a bit more light-hearted and covers the history of the famous Kumamoto Prefecture character Kumamon , again covered in an Asahi Shimbun article: くまモン、やせていた「過去」 失敗糧にキャラ再設定 . Subtitles are available in CC. (23/10/16) Week 1: ブラック 企業 ( きぎょう ) My first vlog is on the ブラック 企業 ( きぎょう ) , the so-called Japanese Black companies . I'm reading the Asahi Shimbun article ブラック企業、見抜くには…転職者から情報、離職率調査 and attempted my own translation as seen in the subtitles (I've added them as soft-subs in YouTube, so you can (de)activate them at will). 2 (16/10/16) Photograph of my desktop set-up. My voice-recorder is a classic Blue Snowball model. ↩ The beginning of the video is a bit rushed, sorry! ↩","title":"Narrating Newspapers: Weekly Vlogging as a Japanese 練習","url":"https://steviepoppe.net/blog/2016/10/narrating-newspapers-weekly-vlogging-as-a-japanese-lian-xi/"},{"tags":"Studies","text":"Those who know me might accuse me of preaching the memorization tool Anki as the best thing that's ever happened to studying, and they wouldn't be that far off. Over the past year I've extensively integrated this software in my studies, with (to me personally) remarkable results in both productivity and academic grades. There are however, some pitfalls for the casual user to take heed of, and getting the full benefit of your time requires cultivating a proper mindset. As I mention Anki a great deal on this site, I decided on writing my own short guide on setting up and using Anki, as well as describe how I personally integrate it into my studies. Anyone with an interest in studying Japanese will surely already have heard of Anki. It's covered extensively on all the major learning resources online, and the canonical self learner's beginner path seems to be Heisig's Kanji method , Tae Kim's online Grammar Guide and Core 2K/6K/10K 2 , all three heavily relying on Anki. Language acquisition certainly remains Anki's most popular usage, but lately, the software's become broad enough to find it's way in various other branches (it's become an integrated routine for medical students, for example, as well as math students thanks to LaTeX support). So far this sounds like I'm paid to advertise Anki. Except the software's free and open source , and if you don't like synchronizing your anki progress over Anki's servers you could even set that up on your own as well 3 . What is Anki? Why is Anki?! How is Anki?!? To recap: Anki is an extremely customizable application designed for memorization, available for free on nearly all the major platforms 4 as well as being accessable online. Being able to study on the road (I commute by train, taking me up to 3 hours total traveling time every day) and synchronizing your progress at home is a major boon on using your time practically. There are plenty of studies on methods for efficient learning, and unsurprisingly, classic late-night cramming, and passive studying methods as extensive marking and rereading of texts don't score very high. On the other hand, active recall testing (questioning yourself by actively trying to come up with the answer to a question) and spaced learning (spreading information absorption over long periods of time) are concidered key 5 . Anki is an application that achieves both through the means of timed flashcards. The concept is simple: the front of the card asks you a question and the backside displays the answer. After showing the answer, you decide whether you got it wrong or right, and to what degree. This determines when you'll be confronted by this card again. The Guide Setting up! Download & Install Download the application for whatever system you'd like it on Anki's homepage and follow the installer's steps. I highly recommend purchasing a lower-end smartphone if you're still using a brick as cellphone. It's somewhat of a steep investment, but worth it in the long run (not just for Anki but plenty of other learning tools such as dictionaries or OCR tools 6 ). Anki's layout, especially the desktop application, is pretty barebones but functional and self-explanatory enough to get used to in a couple of minutes. Account & Syncing To be able to syncronize your progress over different devices you'll have to register an account at Anki's web service (I definitely encourage doing this regardless: just imagine the horror if your device breaks down after 3 years of having intensively studied flashcards). In your desktop Anki, open Settings → Preferences from the menu, then select the Network tab and insert your user credidentials. From the Anki's main menu, select the syncing icon to try it out. Now do the same on your mobile device. On Ankidroid this is Settings → AnkiDroid → AnkiWeb Account . Make sure the \" Download Media \" checkbox below \" Synchronize \" is marked ! Now try syncing from this device as well. If everything goes well, we'll start with our first set. Creating your first set and cards! It's best to consider Anki's main interface as a container for your decks (also called sets) of flashcards. There's no content yet on a fresh install, aside from a filler deck called Default . Feel free to remove this (set-specific options are available through the icon on the right of each set). There's a lot of premade content on the internet, but in order to get used to the interface and learn some of the base features, we'll create a small set, set up a template for our notes, and create some cards - all by ourselves . Don't worry if the terminology doesn't make sense yet, we'll cover that over this guide. As an example we'll create a deck containing some important dates, events and notables in Japanese history. Start by clicking the Create Deck button in the bottom bar, and name it Japanese History or something. We'll create two more decks, 0 - Important dates and 1 - Meiji . Click and drag these right under the original Japanese History set to make subdecks out of them, as shown below. Anki orders sets alphabetically, so I often use numbers to realize my intended structure. Now click on \"1 - Meiji\" to enter that set. As there's no content yet you'll get an appropriate congratulatory message. Doesn't matter, we're on a different mission now, on a mission to create . Click on Add to start on your first card. This is how it will look like in the end. Before starting, it's a good thing to note you'll never actually create your own cards directly. Instead, what you're actually making in this screen is a note , a kind of blueprint containing all information relevant to a certain subject. This is useful because you'll often want different kinds of cards on the same subject. A note on a particular foreign word might contain the original, the translation, an audio file and an example sentence. If notes are blueprints for cards, note-types are blueprints for notes. Using this data, you could set up the note-type to generate three cards: one on visual recognition, one on oral recognition, and one on production, all three containing the example sentence along the answer. I made a brief, crude diagram trying to visualize the result of this tutorial. It's not 100% correct but as I'm trying to keep it simple, it should be sufficient. A set or subset contains notes. As mentioned above, those notes have a note-type and include settings like the amount of fields it contains. In a note-type, you'll also specify card-types. Card-types serve as blueprint for the actual cards you'll study: it determines things like which fields are shown and the actual layout. Thus when you create a new note, it'll generate cards based on the card-types contained in your note's note-type. If this doesn't make sense yet, don't worry, you'll get it doing this tutorial. Type:Basic means we'll create, unsurprisingly, a note of the basic type. These notes have only two fields (a front and back), and only one generated card: one that shows you the front as query, and the back as response. We'll create a new note-type in a second, but for our first note this is fine: a card on Ito Hirobumi , an important figure in the modernization of Japan during the 19th century, using below's explanation. Inserting images is easily done by copy/paste. As example, copy Ito's portrait on the right and paste it in your Create Note screen. Who Lower-rank Samurai in Choshu - politician - 4x PM - Resident-General of (protectorate) Korea - founding father of Modern Japan - assassinated by a Korean nationalist. When 1841 - 1909 Where Born in Choshu, studied in Universy College London (1863) together with Choshu Five . Spent 18 months in Europa studying different constitutions. What Originally a sonno joi movement member before foreign studies. On return, warned Japan against Shimonoseki passage war. Set up a cabinet and tax system, became prime minister and set up Meiji Constitution . Also important for the removal of several Unequal Treaties. It's a good practice to properly tag your cards as well. You can add multiple tags, separating them with spaces. This allows for quick sorting in Anki's card browser. You'll end up with something like the screenshot to the right. Now finish up by clicking add . Congrats, keep this up and you'll breeze through your exams! Creating your own cards… Efficiently ! Our first ‘efficient' card will be one on a tipping point in recent Japanese history: the Meiji Restoration in 1868 . We'll create a new note type that generates two cards, and finally, alter the basic template to allow furigana displayal on touch. This one's meant to get a feeling on Anki's diverse extension options. You'll end up with these cards: First, switch sets to the ‘ 0 - Important dates ‘ subset. If you're still on the previous add-screen, switch sets by clicking on the corresponding set button near the top right. There are various ways of creating a new note type. For now, just click on the basic type, then manage on your next dialogue screen, and add on the one thereafter. Select the first option, and name it something like DateEventDetail . Return and select this new type as your active note type. Next up, you'll be editting this note's fields. You'll want a note that: contains the event's specific date ( 1868 ), the event's name ( Meiji Restoration ) a field for more detailed information . Thus in the field screen, add a new field called Detail , and rename (don't delete) the other two to Date and Event . Go ahead and add data in our fields. For the detail field, copy-paste below's text. Copy-pasting doesn't include below's layout however, so you'll have to do this manually using the toolbar demonstrated in below's screenshot (or using classic shortcuts as ctrl-b used in other text-editors). When finished, don't click on add just yet! Cause Commodore Matthew C. Perry (Convention of Kanagawa) - unequal treaties (Harris Treaty) - sonno joi movement Rise Satsuma-Choshu Alliance - resignation of Tokugawa Yoshinobu (15th and last Tokugawa Shogun) - Boshin War Key points Restoration of imperial rule : return of the Emperor's practical abilities The end of Sakoku policy , as well as the Bushi dominated Bakufu, and 265 years of rule by Tokugawa Shogunate Five Charter Oath promulgated at Emperor Meiji's enthronement. \" one reign, one era name \" ( 一世一元 ( いっせいいちげん ) ) system adopted: the start of eras named after their emperor. Effect Meiji constititution ( Ito Hirobumi , 1890) - abolition of the han system ( 廃藩置県 ( はいはんちけん ) ) - abolition of the four class system ( 士農工商 ( しのうこうしょう ) ) - land and tax reforms - nationwide subscription - satsuma rebellion - Rapid industrialization - 富国強兵 ( ふこくきょうへい ) and militarization Finally, we'll change the cards generated out of this note. Click on the Cards button and take a good look around. Terms in double brackets (eg. {{Event}} ) are variables and represent either your note's fields or its front/backside (eg. {{FrontSide}} ). Through tags as <br> and <hr> , you might notice cards use HTML (the markup language used in webdevelopment), while the style-screen in the middle defines your card's style using CSS (the same standard used for layouting in webdesign): stuff like colors, font-types, etc. Note that, while it could help, you really don't need any experience in these to make nice cards. Start by editting your current card. Name it date by clicking more → rename . Next you'll want to add the contents of your detail field to your backside's template. <br><br> creates two line breaks in HTML, adding sufficient room between the content of the two fields. {{FrontSide}} < hr id = answer > {{Event}} < br >< br > {{Detail}} Now click on the + button in the upper-right corner to add a new card. Name it Event . This time you'll edit the templates of the front and back to question you on the event's date along the details by switching the {{Event}} and {{Date}} variables around (there's a button for that, but try it manually to get a feel on variables / templates). Give if a shot. When finished, you should now have something similar to the screenshot on the left. If you're still with me, I'd like to introduce you one last useful feature (for now). This one might be less relevant for those not studying Japanese, but honestly, it's a neat one to keep in mind when designing your cards (I occasionally use it outside language-learning as well). Remember those kanji up there? They had furigana 7 on top. We'd probably want this in our cards as well. Luck goes it setting this up is extremely simple and support comes out-of-the-box: just add furigana: (all lower-caps) in front of your field variables in the card-note template screen you're in, eg. {{Detail}} becomes {{furigana:Detail}} (you won't see any visible changes yet as we haven't added the actual furigana in our text itself yet). Actually, to accomodate Japanese learners, we'll take away the crutches of kana reading aids and let it display only on touch. Add the CSS below to the bottom of your note's style (the one in the middle). This hides all furigana (or rather, ruby annotations) by default and displays them upon touch or hover. ruby rt { visibility : hidden ; } ruby :hover rt { visibility : visible ; } Now, add the actual furigana, contained in square brackets, next to their respective words: eg. 一世一元[いっせいいちげん] , 廃藩置県[はいはんちけん] , 士農工商[しのうこうしょう] , and 富国強兵[ふこくきょうへい] . When done, let's wrap things up by clicking add . Now that you've created your first set(s) and a couple of cards, I highly recommend changing the studying settings tied to your sets as well. Out of the box, Anki will add 20 new cards and allow only 100 repetitions a day . This is highly inefficient. We'll want to remove the top barrier and be in control of the amount of new cards we study. Open your main deck's settings by clicking the icon to the right and selecting settings. Don't worry, these settings pertain all sets fixed to this \"option group\", so you won't have to do this manually for all your new sets. Edit these three elements: New Cards : new cards/day -> 0 Repetitions : maximum reps/day -> 9999 Mistakes : action on difficult cards -> tag only Instead of an arbitrary number of new cards every single day, you'll be in control yourself by clicking \" customized study \" from the set's menu, and choosing the amount of new cards you'd like to study. I've exported my own copy of this example and uploaded if you want to compare or save yourself the work doing it manually: Download : Example set Japanese History Your first set… Efficiently ! If you're starting on a new language, you'll probably want to start by learning basic vocabulary common in every language (eg. words such as \"person\", \"name\", etc). If that's the case, there's no need to reinvent the wheel: look for premade decks and eventually adjust the card lay-out to your own liking. Anki's own shared deck repository is a good place to start. If there's no premade decks to your liking, but you have access to large data files such as large word lists, another solution would be to import CSV 8 files or other forms of text seperated by tabs or semicolons and mapping the contents to your note's fields. An added benefit of this approach is it's suitability for group (or class) work, by setting up a googledoc sheet, and through a joint-effort creating a large spreadsheet everyone could export as CSV. If there's demand, I could hack up a small (we'll see) guide on setting this up. Personally, I've set up my environment to import any new Japanese word I encounter online and would like to study straight into anki with audio and dictionary definitions. As this goes beyond the scope of this article, I've written another tutorial on that, and definitely recommend that approach for Japanese learners. Structuring Data \" But Stevie \", I hear you ask, \" how do I study less structured information with Anki? \" Good question. This involves some thinking on your part: what is it that you'd like to reproduce? What information would you like to memorize? Think creatively on your course and in what different ways you could structure it in bite-sized pieces to feed your ankiset 9 . Courses are designed with a certain logic in mind, after all. You could start off by making subsets on each of the big chapters of your textbook, or create the answer to potential questions first, mark the important data next, and ankify 10 this. This processing is an important step in grasping the big picture and part of the actual studying . This is the exact reason why I'm reluctant to share some of my own sets that don't involve the need for just rote memorization. Over the past two years at university I've devised and adjusted my own method to structuring and creating ankisets. Feel free to try it yourself (your mileage might vary). It goes somewhat as follows: Structure : create a structure based on the course's one (this could be as simple as copying the Table of Contents) or on repeating elements (certain theories, models, periods in time, artists, their works, etc). If the content of a single class is relatively self-containing, this is even easier. Use this as template for your set. Analyse : analyse all your available sources: your textbook, own notes, powerpoint presentations, etc. Find repeating elements, highlighted or marked parts, and everything that strikes as important. There's a reason for this and these should be given priority on memorization. Devide : try to devide and rephrase these into flashcard suitable questions. Use the Five Ws 11 as guideline if stuck (What, Who, When, Where, Why). Try to remain brief in the backside of the flashcard: I often break this rule myself, but, if you have to scroll down, it's usually too long. Style : Different information requires different styling. Alter your templates and note types to reflect these by using graphical elements, cloze-encounter, audio, different directions, etc. A simple example: to memorize important dates, I use a card with three fields (Year, Event, Information) and generate two notes on these: one displaying the year in front, one displaying the event. Both show further details on the back. Study : You've analyzed the contents. Congratulations. Get started on these new cards. If I studied something marketing-oriented I'd probably call this the SADSS-model and write an e-book called \" 5 Steps To Master All Knowledge (and make you a succesful and better person along the road) \", free of charge if you subscribe to my non-existent newsletters. If I were a social media marketeer I'd add \" Number 5 will shock you! \" as subtitle. (Don't worry. I won't do either.) Spaced Learning \" Stevie! If I'm a college student studying one, or several, language(s) alongside other theoretical classes (and I most likely am since I'm reading this blog), won't this mean I get to repeat hundreds to thousands of cards every single day?! \" Yes. Yes it does mean that. Think of it this way. You'll have to study either way. Language acquisition comes with it's sacrifices: you can't just stop studying for a few weeks and expect to come out unharmed. Building up an internal dictionary containing tens of thousands of words you recognize on sight or produce actively, utilizing grammatical structures on the spot (often under severe pressure), or comprehending speech at real-time; all of these require an effort not just to memorize but to maintain as well. Same goes for any other class, you can't cram your way through university. What this method offers is a way of structuring your data and studying efficiently: paradoxically by studying more you'll actually save time, as there's no need to repeat what you already know. If you're utilizing Spaced Repetition 12 , the data you need to know will be served (roughly) the moment you're about to forget it. \" Even if I'm on a holiday? This makes me very sad! :( I'll just pretend this method of studying is not suitable for me and dismiss anki forever! \" Sadly, this does mean maintaining your cards even when you'd prefer spending your day in a different way. There's no pause button to put your cards on hold, so if you fail to go through them several days in row, you'll have piled up all those lost days and take forever to get through them again. Of course, once the set has finished it's purpose (usually preparing for an exam), you could just as well delete it. It does feel as a waste (after all, what's the point of studying in the first place?), but sadly it's just unsustainable to maintain everything , all of this deep knowledge, till the end of times. Another approach here would be to suspend the more trivial cards and just stick on the broad outlines. The choice lies in your own hands! ™ I spent about a month on a road trip in the USA this summer; unforgettable memories aside I did maintain my Ankisets the whole time. But as I removed all of my non-Japanese sets and maintained the bare necessities of vocab and kanji, this meant only about half an hour of studying each day. That's not too bad, huh? Anyway. As I've said earlier, you'll have to study either way. It is entirely possible that the way Anki and it's spaced repetition work don't work for you, but don't lie to yourself either . 13 Find another way that does work for you. There are plenty of studying methods that could be suitable, including some interesting new ones 14 gaining popularity, but more likely as not, reading and marking your textbook a few times and cramming a summary the night before an exam is not one of them. \" But wait Stevie hold up, if I get this right, I'll be forced to use Anki, like, forever? Won't I ever be able to just quit and bask in my new-found fluency? \" This one's a bit difficult. I've heard of people using Anki for over 8 years , applying it solely as a language maintenance tool and only very occasionally adding new vocab cards when appropriate. This rings more true to me. Spaced learning means they're only getting like 5 - 10 mins worth of repeating old cards by now anyway so why not? If there's ever a time, however, when you're comfortable enough to process media as-is, and you feel you've been a slave to software for far too long, don't let me stop you uninstalling Anki and breaking out in some form of freedom dance. Just… don't let all that progress go to waste! Maintain your language skills! Wait! There is more! The main goal of this post was to introduce Anki both in it's core usage as well as the wide range of appliances in the field of both linguistic and academic studies. If you've any further questions, feel free to leave a comment below. That being said, Anki is customizable to the point books have been written on it. Thus trying to contain everything in a single post (hence \" A quick guide to Anki \") is a mission impossible. There are several other features I feel are useful (and underrepresented) enough in mainstream language blogs to warrant further writing though (namely Anki's API, statistics, useful plug-ins, and integrating Rikaisama and J-pod101's audio). Check these out in my next blogs: Setting up a perfect vocab-mining environment with Anki and Rikaisama Using Anki's API to contextualize your vocab cards with example sentences Making the switch: J-J definitions in your vocab cards Further reading Anki Manual : the official Anki manual. If you're into that kind of thing, theirs is excellent and very comprehensive. I recommend saving these for after you've gotten used to the software a bit. Japaneselevelup.com : one of the most popular Japanese self-learner resources out there, themed after a roleplaying videogame (a bit gimmicky but there's a large audience for that stuff). Probably mentions Anki more as I do ( my god ). Twenty rules of formulating knowledge : an article on making quality flashcards by Dr Piotr Wozniak , the author of the very first SRS algorithm as used in Anki predecessor SuperMemo . Anki Essentials : a 100+ page guide on using Anki. Told you there were books written on Anki. I'm not much of a fan on the downloadable self-help e-book hype but for what I've read, this one's surprisingly good. Image taken from the 2012 Japanese animated film Wolf Children by Mamoru Hosoda, used under Fair Use doctrine. ↩ Flashcard sets consisting of respectively 2000, 6000 or 1000 words with example sentences, all accompanied with high quality audio. They're available both as Ankisets or on Anki alternative Memrise. As I've started learning Japanese through university I can't attest for it's helpfulness yet, but the addition of spoken sentences for context is a major advantage indeed. ↩ This is for more technical users and there really is no reason not to use AnkiWeb's servers, unless they're permanently down for some reason. Read more on https://github.com/dsnopek/anki-sync-server . ↩ Except if you're on iPhone, but if you're able to afford Apple products that shouldn't be much of a problem. Aside from donations that's the only income the developers get anyway, and it's license is peanuts compared to buying any triple-A videogame on current-gen consoles. ↩ Karpicke, Jeffrey D., en Henry L. Roediger. 2008. \"The Critical Importance of Retrieval for Learning\". Science 319 (5865): 966–68. ↩ OCR : O ptical C haracter R ecognition: basically recognizing text or characters through an image (like a scan or photograph taken with your cellphone). I recently found this free manga reader for Android with OCR and dictionary which looks pretty cool. Check it out at http://ocrmangareaderforandroid.sourceforge.net/ ↩ A Japanese reading aid by printing the word's pronunciation in syllabic characters above the original word. A more general term for this is ruby, and such annotations are commonly used to romanize other languages as well. Read more: https://en.wikipedia.org/wiki/Ruby_character ↩ C omma- S eperated V alue files: plain text containing data formatted as table by seperating them through commas. ↩ The danger in this is learning information loose from it's context. Be sure to structure your ankiset accordingly as well to remain aware of the big picture. ↩ to ankify : \" to process large sets of information into small, managable flashcards prepared for the memorization tool Anki \". At least, that's how I'd expect to see this term if it were to actually exist. ↩ A popular formula of questions, whose answers are considered as base intel, in any type of problem-solving, research or journalism. Read more at https://en.wikipedia.org/wiki/Five_Ws ↩ SRS or S paced R epetition S ystem is how the Anki/learning community commonly referred to spatial learning. ↩ Actually there are several notables arguing against Spaced Repetition, but honestly, the real value in these articles lies in the counter-arguments provided in the comments. Example: https://www.scotthyoung.com/blog/2012/08/05/forgetting-is-good/ ↩ Memory Palaces (also known as Method of Loci ) are gaining some new popularity thanks to TV series Sherlock, and rely on spatial memory. Venn Diagrams and other kinds of graphical tools also target our visual memory, and are quite helpful, but these could surely be combined with SRS (in fact, I believe visual stimuli are fundamental to your sets anyway). ↩","title":"A Quick Guide on Using Anki (effectively) (in an academic context)","url":"https://steviepoppe.net/blog/2016/09/a-quick-guide-on-using-anki-effectively-in-an-academic-context/"},{"tags":"Personal","text":"This weekend the NHK Culture Center and the Embassy of Japan in Belgium organized the 30th edition of the Japan Cultural Festival, held in Antwerp in celebration of 150 years of friendship between our two nations. Together with a few classmates and upperclass students I had the honor and pleasure of joining this event's staff of interpreter volunteers, spending my last 3 days assisting two incredible (and incredibly kind) artists convey their works to a large crowd of highly interested Japan aficionados. The festival included a wide variety of exhibitions, demonstrations and performances related to Japanese artistry: dances, drum performances, calligraphy, clothing, tea ceremonies, etc. During the festival I was responsible for a stand on artistic calligraphy and a Japanese embroidery technique called sashiko ( 刺し子 ) 2 , two fields of artistry I had no prior experience in and thus learned a lot about through my interpreting those 3 days. Interpreting as barely just a third year student was quite an experience. The amount of technical terms related to embroidery ocassionally made it pretty difficult to accurately translate everything in real time but I think I somehow managed to convey the overal meaning most of the time. Something that quite surprised me how engrossed I got in my interpreting as well as the group sense we fostered. I felt a certain sense of pride everytime guests complimented on our booth's exhibitions. Another thing that surprised me was the high interest in these art forms I originally thought maybe to be too specific to draw large crowds. Both days of the event were highly visited and left us drowned in work to the point we barely had time to eat a snack at noon. At the end everyone was exhausted, but it was definitely a good kind of exhaustion, and spending the evening together having dinner in the city center of my hometown made it all the more a pleasant memory! (me and the two artists, Hashimoto Shiori and Chiharu Minato at our booth) (The opening ceremony was extremely formal, but I was pleased to occasionally perceive a little joke in the Japanese speeches that didn't translate well in Dutch) (Alas, due a dead cellphone battery, I wasn't able to take a lot of pictures of the events.) Opening ceremony of the Culture Festival. ↩ Sashiko clothes are commonly made from Japanese indigo blue dyed cothon clothes embroided with distinct Sashiko patterns - https://en.wikipedia.org/wiki/Sashiko_stitching ↩","title":"Japan Cultural Festival in Antwerp 2016","url":"https://steviepoppe.net/blog/2016/11/japan-cultural-festival-in-antwerp-2016/"},{"tags":"Personal","text":"Last year, I cooperated with several other students at my music academy to write the music for a small local musical called \" Dating - a musical for the highly educated \" (a supposedly ironic, yet pretentious title I'm less than fond of, honestly). Being slightly unsatisfied with the end-result of my own compositions, I've since started rearranging them. I intend to describe the process in this little blog post. The Idea Under the wings of our arrangement teacher, we collaborated with the Word & Song division of our music academy and the Kontich Orchestra. The W&S division provided the actors, came up with a general concept and devised a tentative track list as well as additional background information we were to use as guidelines in our compositions. We held frequent meetings with the Kontich Orchestra for rehearsals, further fine tuning, and to get a better feel of each musician's capacities and the sound of their instrument. In the end, due time limits, I only contributed two songs but I'm happy to have been part of the project despite the in my opinion somewhat pretentious premise. The following flyer was distributed around town: The Story \" Dating - a musical for the highly educated \" involves a group of supposedly less than highly educated adults from out of town who've met up for a double date using a popular dating site. A couple of teenagers, obsessed with selfies and being young (the average age of the writing team was about 50 years by the way) take note of this and decide to ruin their fun by pretending to be each others date. Somewhere near the end, things get heated up so much that a member of the audience, using classic \" breaking the fourth wall \" 1 techniques, calls the musical to an abrupt end by spouting some idealistic wishes on the concepts of love and relationships. At this stage, Bacchus 2 and Cupido make their entrance in a rather absurd fashion and save the day by convincing the audience that yes, it's important to believe in love. (I just wrote the music! I take no part in this plot!) The Songs The Banana Caves This song is played right at the start of the second half of the musical. As the cast enters the bar and spends a while having a few drinks too many before breaking out into dance, my guidelines were to create a slow \"ballad\" that leads into a funky, danceable second half. Unfortunately, I have no proper recordings of the actual musical, but the following track is my work-in-progress rearrangement. As I've yet to run it through a VST it sounds quite synthetic but I hope you enjoy it nontheless. This might sound silly, but I'm rather fond of videogame composer David Wise's soundtrack to the original Donkey Kong Country games for the Super Nintendo console, games I grew up with as a kid. I tried to create a similar atmosphere in my song and named it The banana Caves as a kind of homage. It's basically done but the part between 3:50 and 4:00 needs some further work. :P Creepy Intermezzo The second piece I wrote was a very last minute composition used during the intermezzo, a time when the actors needed a brief moment to rearrange the decor. I wanted to create something mysterious and film-ish to keep the audience in suspense. At the time I had been playing a lot of Erik Satie's work and based my theme's base on his Gnossiennes. The further arrangements were inspired by the gothic soundtrack of Coppola's \"Bram Stoker's Dracula\" . In retrospect, I should've read the script more carefully; the particular mood I tried to convey with this track wasn't the most suitable for the relative lighthearted musical it was meant for. It like the piece's main theme but I'm not satisfied with the quick ‘n dirty arrangement so I hope to start over some time. That's it for now! I'm in the process of rearranging and mixing several compositions in my spare time so I'll be sure to post here when I have something new tangible. a theater convention intended to heighten a piece's realism: actors act in such a way that an imagined, invisible wall seemingly seperates the audience from the stage. Breaking this wall refers to the act of proceeding contact between the stage and the audience. ↩ Bacchus , the Roman god of agriculture and wine and equivalent of the Greece Dionysus. He's often associated with hedonism. ↩","title":"Writing a Musical?","url":"https://steviepoppe.net/blog/2016/10/writing-a-musical/"},{"tags":"Studies","text":"I've recently started studying Korean as part of the minor I took up at university. While browsing the internet for helpful resources I found that, like myself and my classmates, a remarkable amount of students of the Korean language have knowledge of Japanese and/or study both simultaneously. As anyone browsing my blog might have guessed, I'm pretty fond of using Anki for assisting in vocab acquisition, and thus use it for Korean vocabulary as well, using both existing sets and my own based on our textbooks 2 . Having a broad base in Japanese, I thought it would be more efficient having a link between the two languages in my flashcards. In order to assist myself and other learners of both Japanese and Korean, I wrote an Anki add-on that adds Japanese translations of Korean expressions. Similar to my previous Anki posts, this blogpost serves as a brief tutorial on setting up the add-on and adding Japanese translations to our cards. We'll install an Anki add-on, alter our card-layout to display the Japanese expressions in a fashionable manner, and finally bulk-edit our existing cards to actually add them. Anki Korean-Japanese add-on The add-on scrapes Weblio's online Korean-Japanese dictionary for all translations aside from the usually present character decomposition. The expression 개 (transcribed as gae 3 or kae 4 and means either dog or is used as a particular counter), for example, results in the following page : (If I feel comfortable enough, or there's enough request, I'll expand the add-on to scrape the example sentences as seen above as well) Download The Japanese Definitions for Korean Vocabulary add-on has a page on Ankiweb's plug-in page , but as usual we'll install the plug-in using the Desktop Anki application. Go to Tools → Add-ons → Browse & Install , and copypaste 553926167 in the pop-up dialog. Restart the application to complete the installation. Set-up The add-on expects two things: The field containing your Korean expression should be called: Korean The notetype should contain a field called Japanese which will contain the japanese translations (Both names can be editted in the JapaneseDefinitionsKoreanVoc.py file by opening it with a text-editor and changing the names listed in the beginning. The file can be found on the Anki's add-on folder on your computer (eg. C:\\Users\\your_username\\Documents\\Anki\\addons )) To create a new field Japanese , open the desktop Anki application and press CTRL-SHIFT-N (or click Tools → Manage Note Types ) to enter the notetype management screen. Select the notetype of the cards you'd like to contain example sentences and click fields . On the next screen, click add and call the field Japanese . Now close this screen. On the previous notetype management screen, click cards . We'll edit our lay-out and display the new field in our cards. Anki Note Lay-out (this is a suggested Anki layout as seen in the screenshot below. Feel free to skip if you'd like to do this yourself.) Lay-out Add below's CSS code to the shared style screen of your note's card-type template. .title { color : #999999 ; font-size : 80% ;} .notes { color : #449933 ; font-size : 80% } Templates Add the following code to the bottom of all your different card templates' back template. {{#Japanese}} < br >< div style = 'text-align: left; ' > < span class = \"title\" > Additional Information: < br ></ span > < span class = notes > {{Japanese}} </ span > </ div > {{/Japanese}} Bulk-edit Open anki's browser (by pressing b or clicking Browse from the main window). The left of this browser has an overview of all your different sets and tags. Select the deck or tag containing the cards you'd like to edit. Press ctrl-a to select all of those and click Edit → Regenerate JK Expression . It will crawl the internet for each new definition and scrape the HTML so if you have thousands of cards this might take an hour or two. Result Screenshot of JapaneseDefinitionsKoreanVoc.py code from Sublime Text's editor. ↩ Cho, Young-mee Yu, red. 2010. Integrated Korean: Beginning. 2nd ed. KLEAR Textbooks in Korean Language. Honolulu: University of Hawaii Press ↩ According to the official Korean Revised Romanization ↩ According to the widely used McCune-Reischauer romanization system, which tries not to transliterate but rather represent the phonetic pronunciation. ↩","title":"Anki Add-on: Japanese translations for Korean vocabulary","url":"https://steviepoppe.net/blog/2016/10/anki-add-on-japanese-translations-for-korean-vocabulary/"},{"tags":"Studies","text":"You've been studying Japanese for a while now and reached a level of Japanese adequate enough to understand (simple) texts. Drilling new vocabulary has become a daily routine so entangled in your lifestyle you barely notice anymore. If you were to describe your current level of proficiency, you'd proudly present yourself as an intermediate level learner. Sounds familiar? Let's take it a notch further by adding Japanese definitions 2 to our ankisets and reduce our dependency on English definition crutches! If you've followed my previous tutorial on adding Japanese example sentences to your vocabulary cards, this tutorial will feel very similar: we'll install an Anki add-on, alter our card-layout to display the definitions in a fashionable manner, and finally bulk-edit our existing cards to actually add them. (This might be my first tutorial worthy of the header quick ). Sanseido add-on There are various online monolingual dictionaries for Japanese vocabulary. I personally like Weblio and Goo , but for our Anki cards we'll use Sanseido - their definitions are usually more concise as the other dictionaries and tend to employ more comprehenseble vocabulary. Luck has it someone has already written an anki add-on to serve our blog's purpose. The result of our work will look as follows: Download The Sanseido Definitions add-on has a page on Ankiweb's plug-in page , but as usual we'll install the plug-in using the Desktop Anki application. Go to Tools → Add-ons → Browse & Install , and copypaste 1967553085 in the pop-up dialog. Restart the application to complete the installation. Set-up The notetypes of the vocabulary you want sentences for will need a new field to contain the Japanese definition. On the desktop Anki application, press CTRL-SHIFT-N , or click Tools → Manage Note Types , to enter the notetype management screen. Select the notetype of the cards you'd like to contain example sentences and click fields . On the next screen, click add and call the field Sanseido . Now close this screen. On the previous notetype management screen, click cards . We'll edit our lay-out and display the new field in our cards. Anki Note Lay-out Lay-out Add below's CSS code to the shared style screen of your note's card-type template. .title { font-size : 16px ; color : #999999 ;} Templates Add the following code below the line displaying your vocab's translation/English definition (eg. {{Meaning}} ) . You'll do this in Expression → Back Template , Meaning → Front Template and Audio → Back Template . < br /> {{#Sanseido}} < br />< div id = \"japanese_meaning\" > < span class = \"title\" > Japanese: </ span >< br /> < span id = \"japanese\" class = \"sanseido\" > {{furigana:Sanseido}} < br />< br > </ span ></ div > {{/Sanseido}} Bulk-edit The plug-in expects your vocabulary to be contained in a field called Word . If your field is called Expression , you'll have to edit this in the plug-in's python file on your Anki's add-on folder (eg. C:\\Users\\your_username\\Documents\\Anki\\addons\\sanseidoDefsForAnki.py ). Open it with your text-editor of choice (notepad is fine) and change expressionField = 'Word' to expressionField = 'Expression' . Open anki's browser (by pressing b or clicking Browse from the main window). The left of this browser has an overview of all your different sets and tags. Select the deck or tag containing the cards you'd like to edit. Press ctrl-a to select all of those and click Edit → Regenerate Sanseido Expression . It will crawl the internet for each new definition so this might take quite a while. 3 Usage with Rikaisama / Real Time Import As with my previous tutorial, a drawback to this plug-in is that it does not support vocab expressions using furigana, and neither can example sentences be added automatically on adding a new note through rikaisama. We'll have to make some small adjustments for that. I've added the editted files on a new repository on my github so go ahead and replace the existing add-on files on your Anki's add-on folder on your computer (eg. C:\\Users\\your_username\\Documents\\Anki\\addons ) with the ones on there. I've described all my edits below in case you'd prefer to do this manually. Feel free to skip this part if you're not technically inclined. Set-up sanseidoDefsForAnki.py We've set up our notes to show furigana on our vocabulary. This requires square brackets (eg. 気象庁[きしょうちょう] ). The anki plug-in for Japanese examples however does not support this out of the box. For that reason, I've added a single line of code that uses a regular expression to only use the contents up to the first square bracket as expression. term = re . search ( r'&#94;[&#94;\\[]+' , term ) . group ( 0 ) If you'd like to edit this yourself, add below's code as first line in the fetchDef class - it should be around line 27 ( def fetchDef(term): ). Real-Time_Import_for_use_with_the_Rikaisama_Firefox_Extension.py This extension calls on Anki's API to create new notes. I haven't found a way to hook japanese_examples to outside note-creation, so instead I've editted the real_time_import plug-in itself to call japanese_examples at run-time. First, we'll have to import that extension to be able to call it's methods. If you're doing this set-up manually, add below's line near the top, with the other includes (around line 30). from sanseidoDefsForAnki import * Next, I've written a few lines in the createNote method to call sanseidoDefsForAnki's glossNote method at run-time and, if examples were found and our note-type has the correct destination field, add these to our newly created card. This should come before dupOrEmpty = note.dupeOrEmpty() around line 100. # Create sanseido definitions try : glossNote ( note ) except : showTooltip ( \"Error, could not create sanseido definition.\" ); try : note . flush () except : showTooltip ( \"Error, could not create sanseido definition.\" ); Contextualizing imported cards If you've followed above steps, every time you add a new word online by pressing r (the Real-Time Import key) while hovering over something Japanese, it'll automatically contain a Sanseido dictionary definition as well. Try it out on below's \" Words of the Day \"™! {{ 逆転 ( ぎゃくてん ) }} | {{ 裁判 ( さいばん ) }} Download Example Set As usual, I've exported my own copy of this tutorial and uploaded it in case you'd like to compare or save yourself the work of editting the note template yourself. It includes work from the previous two tutorials. Download : Example set Sanseido Wait! There is more! The main goal of this post was to introduce another less known, but highly useful, Anki functionality on increasing your study efficiency, as well as hopefully create an attitude of self-reliability by reaching out various tools and possibilities. If you've any further questions, feel free to check out the other articles in this series on Anki, or to leave a comment below. A Quick Guide on Using Anki (effectively) (in an academic context) Setting up a perfect vocab-mining environment with Anki and Rikaisama Using Anki's API to contextualize your vocab cards with example sentences Image taken from the 2012 Japanese animated film Wolf Children by Mamoru Hosoda, used under Fair Use doctrine. ↩ Google Anki JJ and you'll come across dozens of posts describing the \" leap from the J-E to J-J dictionary \". It appears to be one of the more popular studying methods amongst self learners online, and is highly blogged about on such blogs as Japaneselevelup.com or on the koohii.com forums. ↩ it takes a couple of seconds for one card. At time of writing, I had 20761 cards based on the Rikai note type, filling these in took about an hour and a half… ↩","title":"A Quick Guide on Using Anki 4: Making the switch - J-J definitions in your vocab cards","url":"https://steviepoppe.net/blog/2016/10/a-quick-guide-on-using-anki-4-making-the-switch-j-j-definitions-in-your-vocab-cards/"},{"tags":"Personal","text":"With the academic school year rapidly approaching, my girlfriend and I decided on a short last-minute trip out and booked ourselves cheap tickets to Romania. We spent the week traveling through the historic region of Transylvania, commonly associated with vampire folklore, and situated between the imposing Carpathian mountains. A rich history, ranging from a feudal agricultural culture to a post-war communist regime and more recently the shift to a capitalist mode of production, leaves plenty of marks in its culture, architecture and national mentality, and offers so much more than just touristic amusement. This short blog covers our itinerary, with plenty of pictures to go along with it. Brief history Historically, Transylvania, a traditionally more agricultural region, has been conquered by plenty of nations, including the Roman Empire, Bulgaria, Hungaria, the Ottoman Empire and the Austro-Hungarian Empire until it's disintegration following the first world war. Transylvania, as the rest of Romania, played an important role in European politics throughout the interbellum, but suffered greatly through the second world war and the subsequent communist regime (1947 - 1989). The 1989 revolutions brought an end to Romanian Communist leader Ceausescu's repressive regime 2 and led to the implementation of the free market as well as a 2007 accession to the European Union. The majority of the people are ethnically Romanian, but there's a sizable Hungarian and Roma population as well. Especially the Romani people, an ethnic minority originating from northwestern India and historically serving as slaves in Romania, undergo plenty of discrimination both in Romania and throughout Europe, thus leaving them segregated and socially vulnerable. Itinerary As \"poor college students\" without driver licenses, we relied heavily on public transport. Luckily, Romania has an excellent public transport system both within cities as throughout the country. Thus commuting through the city felt as easy as at home. Unfortunately, due to time issues, we had to cut several important destinations (such as Sighisoara) out of our trip. Bucharest We arrived in Bucharest's Otopeni airport on the 18th of september and after a brief stroll through town headed to Gara de Nord train station for a train to Sinaia. As a west-european citizen, the contrasts were a bit surprising. Balkan and Latin architectural influences contradict strongly with the tight, functional soviet designs, 3 and even the more touristic accessable historical center underwent heavy decay and is now mostly covered in graffiti. Sinaia Sinaia is a quaint little town about an hour and half away from Bucharest and close to the medieval town of Brasov. As heavy focus is put on nature preservation and the weather was excellent, we spent most of our day hiking and enjoying our surroundings. We stayed the night in a cute inn near the center of the town, from where we had an excellent view. Sinaia's monastery, built in 1695, contains two courtyards churches built in Byzantine style and is lovely indeed. Nearby the monastery is an impressive castle reminiscent of Disney castles. Peles Castle, built between 1875 - 1914, was designed in a neo-renaissance style combining different West-European architectural styles. We suffered heavy rainfall the moment we reached the monastery, which made photography a bit more difficult (although it did add to the general atmosphere). Unfortunately the way back down took about half an hour of walking through the equivalent of a small river and left our socks in an unspeakable state. Brasov Still soaked from our earlier trip, we left for the nearby medieval mountain resort city Brasov located between the Carpathian Mountains. We booked a small appartment near the historical center for about 5€ pp/per night. The price reflects the quality pretty well. This was our front door: We spent the first day in this town exploring. One of the most impressive sights in this town is the so called Black Church, a large Gothic church containing one of the largest organs in Eastern Europe. Lucky for us, weekly organ concerts are held during the summer months - something I hadn't experienced yet. Bran Castle On our second day in brasov, we took a short daytrip to the nearby village of Bran visiting the so-called Dracula's Castle, an extremely imposing fortress with, despite any tangible relations with the historical figure of Vlad Tepes, a rich history nonetheless. Sibiu Sibiu, voted European Capital of Culture in 2007, represents Transylvanian Saxon culture and has one of the few German-only schools in Romania. We passed an orthodox church in the middle of a service and were drawn to the sound of a small orthodox choir chanting what appeared to be Russian Liturgical music. I'm not religious, but I do enjoy the ambiance of Gregorian or Russian Znamenny 4 chants. Thanks to the church's accoustics the music really came to life and made it quite a cool experience, even if I felt like an incredibly out-of-place blasphemer at the moment. Turned out september is opera month in Sibiu and this particular evening featured an operarecital accompanied by piano and clarinet. Being a student meant we never had to pay over 2€ for any activity. As usual, large portions of the town were covered in juvenile graffiti. One of the more interesting and politically engaged examples however, designed as modern art project, resonated with me a bit: \"My GREAT_ friends a referendum will not seperate us\" The historical and cultural center has plenty of noteworthy restaurants hidden in basements. We had some terrific traditional 5 food at this place. It must be noted that like most things, food is incredibly cheap for western tourists, ranging around 7.5 - 10€ for a full course dinner including drinks. The ASTRA National Museum Complex is a large (one of the largest in Eastern Europe) open-air museum containing over 300 buildings in traditional Romanian folk style spread across several lakes. Unfortunately visiting at an off-season moment with bad weather meant relatively little to do, but it was worth the trip regardless. Turda Salt Mine The Turda Salt Mine is a hidden gem for tourists visiting Romania. The city of Turda has succesfully transformed one of it's old (first mentions are dated May 1, 1271) salt mines into the equivalent of a modern attraction park, going as far as including a ferris wheel at about 50 meters down underground. The deepest point, around 112 meters deep, contains an underground lake navigable by boat (one of the more memorable things I've done during travels so far) as well as some interesting architectural constructions. Cluj Cluj-Napoca, the second most populous city in Romania and the official capital of Transylvania, was the final point of our trip. After the Turda Salt Mine trip, we spent some time strolling around until we took a night train back to Bucharest for our early flight back to Belgium. Music When traveling, I make it a habit of finding good music by listening to local radiostations or asking recommendations to people I meet in hostels or bars - It's my own personal souvenir and sticks better as regular touristic souvenirs. This trip's band is the Bucharest located Subcarpati , a succesful blend of Romanian folk music with modern hip-hop beats. Conclusion Despite the brief stay and relatively lousy weather we had a great time traveling around. The communist regime and subsequent economic problems have left their mark both geographically as socially, which makes for some very interesting and often heavy contrasting views; yet some of the more rural villages occasionally feel untouched by time and as if they come straight out of middle-age themed fairy-tales. While people might come over as cold and unfriendly, there's a strong mentality of kindness through actions over words, as we've often noticed during moments of distress. We've never felt unsafe, despite an initial surprise over the heavy influence of western media socializing us to view particular people as dodgy or untrustworthy. Also, the food was terrific . Gallery .embed-container { position: relative; padding-bottom: 56.25%; padding-top: 30px; height: 0; overflow: hidden; max-width: 100%; height: auto; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; } Bran Castle by Stevie Poppe ( https://flic.kr/p/LAMBhm - CC BY-SA 2.0) ↩ Ceausescu started of as a relatively progressive Communist leader, going as far as mixing North Korean Juche and Maoist concepts and dismissing traditional soviet elements, but steadily became more extreme, leading to a stalinist regime and heavy conflicts with Russia's soviet reformist Mikhail Gorbachev. Interestingly, after their arrest, Ceausescu and his wife were the last people to be executed in Romania before the abolition of Capital punishment. ↩ https://en.wikipedia.org/wiki/Constructivist_architecture ↩ https://en.wikipedia.org/wiki/Znamenny_chant#Current_usage_and_related_traditions ↩ Traditional Transylvanian food is generally a mixture of Hungarian and Romanian cooking. Read more: https://www.lonelyplanet.com/romania/transylvania/travel-tips-and-articles/a-guide-to-romanian-cuisine ↩","title":"Travels: a week in Transylvania","url":"https://steviepoppe.net/blog/2016/09/travels-a-week-in-transylvania/"},{"tags":"Studies","text":"So you've followed my previous tutorial and set up this beautiful environment for creating vocabulary cards with audio and furigana based on text you read online. Yet, while studying your new set you feel this nagging feeling… There's something's missing still… \" Hm, could it be…? \", you ponder quietly. Yes . Japanese example sentences for context ! One of the common pitfalls of learning Japanese vocabulary through ankicards is memorizing them loose of context. Perhaps you've found yourself in a situation having no particular problems recalling vocabulary whilst reviewing your anki cards, but less so when confronted with real-life situations. If that sounds familar, one way to counter this common problem would be to install an additional Anki add-on, and bring our vocab cards to a next level by adding Japanese example sentences and their translations. This blog offers an easy step-by-step tutorial on setting this up. Additionally, for those who've followed my previous tutorial, I add some extra code to combine the example sentence functions with the instant-import features of the firefox plug-in Rikaisama. Plug-in We'll use an existing Anki add-on called Japanese Example Sentences to add Japanese sentences taken from Tatoeba.org , a \"collaborative, open, free and even addictive\" community on producing example sentences (the internet is such a cool place). The result of our work will look as follows: Download The Japanese Example Sentences add-on has a page on Ankiweb's plug-in page , but as usual we'll install the plug-in using the Desktop Anki application. Go to Tools → Add-ons → Browse & Install , and copypaste 2413435972 in the pop-up dialog. Restart the application to complete the installation. If you want a test Anki deck to work with, I've uploaded an example set, the result of my previous Anki tutorial, containing the necessary notetype and two test-notes for download: Example set Rikai . Set-up The notetypes of the vocabulary you want sentences for will need a new field to contain these. On the desktop Anki application, press CTRL-SHIFT-N , or click Tools → Manage Note Types , to enter the notetype management screen. Select the notetype of the cards you'd like to contain example sentences and click fields . On the next screen, click add and call the field Examples . Now close this screen. On the previous notetype management screen, click cards . We'll edit our lay-out and add the sentences in our actual cards. Anki Note Lay-out Add below's code at the bottom of the middle lay-out screen. It'll display the example sentences to the left of your cards. .examples { font-size : 75% ; text-align : left ;} .title { font-size : 16px ; color : #999999 ;} Back Template Add below's HTML code at the bottom of your different cards' back templates. {{#Examples}} < br /> < div class = \"examples\" > < span class = \"title\" > Sentences: </ span >< br /> {{furigana:Examples}} </ div > {{/Examples}} When done, close both this and the previous screen. Let's try this plug-in out now! Usage Contextualizing existing cards We'll start by adding example sentences to our existing cards (of the notetype we've just editted). Press b or click on \"Browse\" to open Anki's Card Browser. The left of this browser has an overview of all your different sets and tags. Select the deck or tag containing the cards you'd like to edit. Press ctrl-a to select all of those and click Edit → Bulk-add examples . Most, if not all, should contain sexy new example sentences by now. Contextualizing new cards While creating a new card of a notetype that contains the Examples field, the add-on will automatically fill in that field as soon as you've entered a Japanese expression in the Expression field. No further set-up is required for this. Usage with Rikaisama / Real Time Import A drawback to this plug-in is that it does not support vocab expressions using furigana, and neither can example sentences be added automatically on adding a new note through rikaisama. I've you've been following my previous blogpost , you'll probably want to to follow these next steps as well. I've made some adjustments to both the Anki Real-Time Import add-on and the Japanese_Examples add-on. I've added the editted files on a new repository on my github so go ahead and replace the existing add-on files on your Anki's add-on folder on your computer (eg. C:\\Users\\your_username\\Documents\\Anki\\addons ) with the ones on there. I've described all my edits below in case you'd prefer to do this manually. Feel free to skip this part if you're not technically inclined. Set-up japanese_examples.py We've set up our notes to show furigana on our vocabulary. This requires square brackets (eg. 気象庁[きしょうちょう] ). The anki plug-in for Japanese examples however does not support this out of the box. For that reason, I've added a single line of code that uses a regular expression to only use the contents up to the first square bracket as expression. expression = re . search ( r'&#94;[&#94;\\[]+' , expression ) . group ( 0 ) If you'd like to edit this yourself, add that piece of code to the find_examples class right after it defined examples as a list. it should be around line 139 ( def find_examples(expression, maxitems): examples = [] ). Real-Time_Import_for_use_with_the_Rikaisama_Firefox_Extension.py This extension calls on Anki's API to create new notes. I haven't found a way to hook japanese_examples to external note-creation, so instead I've editted the real_time_import plug-in itself to call japanese_examples at run-time. First, we'll have to import the japanese_examples extension to be able to call its methods. If you're doing this set-up manually, add below's line near the top, along with the other includes (around line 30). from japanese_examples import * Next, I've written a few lines in the createNote method to call Japanese-examples' find method at run-time and, if examples were found and our note-type has the correct destination field, add these to our newly created card. This should come before dupOrEmpty = note.dupeOrEmpty() around line 100. # for use with japanese examples examples = find_examples_multiple ( note , MAX_PERMANENT ) # if field is empty and examples exist if examples and not n [ DEST_FIELD ]: note [ DEST_FIELD ] = examples Finally, I've editted the mark-up of the example sentences themselves to hide the english translations unless hovered above (or on press on smartphones). Locate the examples.append call in the find_examples method. You'll want to replace it (I commented it out) with below's line. It'll be around line 174. examples . append ( \"<div id='eng_test'> %s <span id='eng_sentence'> %s </span></div>\" % tuple ( example . split ( ' \\t ' ))) In the find_examples_multiple method (around line 214), replace the current return with below's line. We want only one break between example sentences. return \"<br>\" . join ( examples ) Important! For this to work, you'll need to make an edit in your note template's layout. As usual enter the notetype management screen by pressing CTRL-SHIFT-N , or click Tools → Manage Note Types . Select the notetype of the cards you'd like to contain example sentences and click fields . From there, select the Rikai note, click on cards and add below's CSS code to the bottom of the shared lay-out screen in the middle. #eng_sentence { display : none ; } #eng_test :hover #eng_sentence { display : inherit ; } New Usage Contextualizing existing cards If you've set up rikaisama to include ‘rikai' as tag on new cards, this should be a breeze. Open anki's browser (by clicking Browse or pressing b ), select the rikai tag in the left column, and press ctrl-a to select all your cards. Next, click Edit → Bulk-add examples . Contextualizing imported cards If you've followed above steps, every time you add a new word online by pressing r (the Real-Time Import key) while hovering over something Japanese, it'll automatically contain example sentences as well. Try it out on below's \" Words of the Day \"™! {{ 文脈 ( ぶんみゃく ) }} | {{ 語彙 ( ごい ) }} Download Example Set As usual, I've exported my own copy of this tutorial and uploaded it in case you'd like to compare or save yourself the work of editting the note template yourself. Download : Example set Sentences Wait! There is more! The main goal of this post was to introduce another less known, but highly useful, Anki functionality on increasing your study efficiency, as well as hopefully create an attitude of self-reliability by reaching out various tools and possibilities. If you've any further questions, feel free to check out the other articles in this series on Anki, or to leave a comment below. A Quick Guide on Using Anki (effectively) (in an academic context) Setting up a perfect vocab-mining environment with Anki and Rikaisama Making the switch: J-J definitions in your vocab cards Further reading The 10 000 Sentences Method : one of the more popular online self-study methods seem to be the complete Japanese immersion ( All Japanese All The Time ) method and its 10 000 sentences style of learning: increasing the feel of a language by assimilating and internalizing 10 000 different sentences. To be honest, the arbitrary number of sentences and clickbaity descriptions make it pretty gimmicky (\" Learn Japanese in just 18 months !\" 2 ), but its popularity should give some validity on the importance of example sentences in your vocab-learning. Image taken from the 2012 Japanese animated film Wolf Children by Mamoru Hosoda, used under Fair Use doctrine. ↩ I've read enough blogs on learning Japanese or language acquisition to come up with my own gimmicky clickbait articles as \" Use these methods to watch your Japanese learning abilities soar \" or \" Break the Plateau: 10 easy tips to Master Japanese \" and cash in on ads or selling e-books, but honestly I'm just some guy on the internet learning Japanese and occasionally blogging about cool, potentially useful features. Maybe if I actually sticked on studying instead of needlessly browsing the internet I could've actually made such claims, but no… It's stronger as myself… ↩","title":"A Quick Guide on Using Anki 3: contextualize your vocab cards with example sentences","url":"https://steviepoppe.net/blog/2016/09/a-quick-guide-on-using-anki-3-contextualize-your-vocab-cards-with-example-sentences/"},{"tags":"Studies","text":"Zoals velen in mijn richting ontstond mijn interesse in Japan al op jonge leeftijd onder invloed van het zogenaamde Cool Japan : de verspreiding en globalisatie van Japanse popcultuur (muziek, televisie, games, enzovoort) die toen geleidelijk aan al doorsijpelde in onze nationale media. Het zou zelfs een interesse worden die zodanig groeide dat ik er jaren later mijn studiekeuze door liet beïnvloeden. Vaak krijg ik bij vermelding daarvan echter nog, zoals mijn klasgenoten ongetwijfeld kunnen beamen, een hoop verbaasde blikken toegesmeten en dé klassieke hamvraag voorgeschoteld: Waarom nu juist Japanologie ? Als tweedejaars student hield ik eerder dit jaar op een opendeurdag van onze richting een kort woordje over mijn persoonlijke ervaringen met Japanologie aan de KU Leuven, en probeerde ik ook bovenstaande vraag te beantwoorden. Toch werd ik daarna door verschillende bezorgde ouders aangesproken met enkele niet geheel onterechte vragen als \" Ja maar, wat zijt ge daar nu mee? \", \" Leert ge dan enkel over Japan? Oeioei, is da ni héél beperkt? \" en \" Is Japan nog wel relevant? \". Om beter de oorspronkelijke vraag \"Waarom Japanologie?\" te beantwoorden lijkt het mij het beste om te vertrekken vanuit juist die drie vragen: Vragen \"Japanologie? Dan leert ge enkel over Japan? Oeioei!\" Als je naar de onderwijsaanbod-pagina van Japanologie aan de KU Leuven gaat krijg je het volgende te zien: Bachelor in de taal- en regiostudies: japanologie (Leuven) Bachelor of Arts In de bacheloropleiding Japanologie bestudeer je in de eerste plaats het moderne Japans op een intensieve manier. De opleiding plaatst het Japans steeds centraal tegenover de achtergrond van de Japanse cultuur, geschiedenis, filosofie, economie en politiek. Je kiest een minor, wat je de mogelijkheid geeft om je eigen interesses beter in te werken in je studie. Het spreekt voor zich dat de Japanse taal en studies rond Japan centraal staan in onze richting, maar bovenstaande tekst verraadt het toch al: Japanologie aan de KU Leuven is een onderdeel van taal- en regiostudies, en levert een Bachelor of Arts op, een diploma binnen de geestes- of sociale wetenschappen. Concreter betekent dat dat een student Japanologie een hoop vaardigheden onder de knie hoort te krijgen die geen rechtstreeks verband met Japan vormen. Dat lijkt me ook logisch. Enkel kennis van een bepaalde taal of wat feitenkennis van één bepaalde regio, losstaand van haar rol tegenover de rest van de wereld, lijkt me zonder vaardigheden om te kunnen vergelijken niet bijzonder veel waard. Ondertussen worden computers steeds efficiënter in het instant -vertalen van zowel tekst als audio, en zijn er enorme digitale databanken met historische feiten die gratis geraadpleegd kunnen worden. Wat computers en software echter (nog) niet kunnen is het betekenis geven aan die data. De vaardigheden die we tijdens onze studies leren zorgen er voor dat wij uiteindelijk die leegte kunnen invullen en aldus ook een soort culturele brug tussen naties kunnen vormen. Enkele voorbeeldjes : om de Japanse economie en politiek te kunnen begrijpen is het niet alleen belangrijk om op theoretisch vlak iets te weten over die velden, maar ook om de politieke en economische situatie uit de eigen leefwereld te begrijpen. Om ontwikkelingen in de Japanse hedendaagse pop-cultuur te begrijpen is het dan zeker weer niet mis om kennis te hebben over de historische ontwikkeling van literatuur, of om zich te verdiepen in antropologie, in ontwikkelingen in het terrein van geschiedschrijving, enzovoort. We kijken eens naar een verkort lijstje van zowel verplichte- als keuzevakken binnen de optie culturele minor 2 . Vakken die rechtstreeks verband hebben met Japan of het Aziatisch continent (vakken als \"Inleiding tot de Oost-Aziatische kunst\", vakken uit Sinologie, de Koreaanse taal, enzovoort) heb ik even weggelaten. Verplichte vakken Inleiding tot de wijsbegeerte, Religie, zingeving en levensbeschouwing, Informatiekunde, Sociologie, Recht, Inleiding tot de sociale en culturele antropologie Optie Geschiedenis en Literatuur Inleiding tot de studie van de Europese literatuur en cultuur: na 1800, Geschiedenis van de nieuwe tijd, Geschiedenis van de middeleeuwen, Geschiedenis van de nieuwste tijd, Nederlandse letterkunde I: moderne literatuur, Algemene literatuurwetenschap I Andere keuzevakken Mediacultuur, Inleiding tot de beeldanalyse, Taalverwerving, Algemene taalwetenschap I, Inleiding tot de economie, Geschiedenis van Rusland, Inleiding tot de Slavische wereld, Consumer Behaviour, Academisch Nederlands, Human Rights, Economische ontwikkelingen van Japan, Griekse mythologie en godsdienst, Geschiedenis van de internationale betrekkingen, Hedendaagse politieke en sociale theorieën: marxistische en socialistische stromingen, Sanskriet, East-West Perspectives in Philosophy, Genderstudies Een van onze docenten haalde in de eerste les van het vak \"Ruimtelijke Organisatie van Japan\" een metafoor aan die me sterk is bijgebleven: waar studenten aan richtingen binnen de exacte wetenschappen zich omhoog werken door een ladder te beklimmen binnen het eigen domein, worden studenten binnen studiedomeinen als Japanologie verwacht omhoog te klimmen door middel van het bouwen van een piramide. Elk nieuw veld waarover geleerd wordt representeert een nieuw bouwblok aan die pyramide. Door het bestuderen en beheersen van een hoop verschillende velden (zij het nu politiek, geografie, literatuur of filosofie) creêert men paradoxaal juist een verdere specialisatie in de eigen richting. Deze stelling sluit naadloos aan bij de volgende vraag: \"Wat zijt ge daar nu mee?\" Het cliché gaat dat richtingen binnen Letteren, waartoe Japanologie behoort, het niet goed doen op de arbeidsmarkt. Met een verzwakte economie is er minder vraag naar dergelijke diploma's, en cijfers worden dan naar hartelust rond onze oren gesmeten: zo zouden bijvoorbeeld volgens dit vacature.com artikel uit 2010 , gebaseerd op cijfers van de VDAB, 25% van de afgestudeerden met een academische bachelor taal-en letterkunde nog steeds werkloos na 1 jaar zijn. Ook een recenter jobat.be artikel uit 2013 plaatst Masters in Oosterse talen en culturen als een slechte keuze. De werkelijkheid is uiteraard complexer als wordt aangegeven. Uit diezelfde studie van de VDAB stond in 2011 één schoolverlater met een master in \"Taal en regiostudies: Oude Nabije Oosten\" geregistreerd. Diezelfde schoolverlater stond tevens na 1 jaar, in 2012, bij de VDAB geregistreerd als werkzoekende, waardoor het percentage werkzoekenden na 1 jaar binnen \"T&R: Oude Nabije Oosten\" op dat moment als 100% werd geklassificeerd. in 2014 waren er dan weer 3 schoolverlaters in die richting, die in 2015 niet stonden geregistreerd als werkzoekenden: een percentage van 0% werkloosheid bij afgestudeerden \"T&R: Oude Nabije Oosten\". 3 De situatie is vergelijkbaar voor Japanologie (zie foto beneden), dus staar je zeker niet blind op dergelijke cijfers. Uiteraard houdt de richting Japanologie aan de KU Leuven daar wel rekening mee. Een van de twee minors, de economische minor, richt zich sterk op het verwerven van economische vaardigheden rechtstreeks inzetbaar op de arbeidsmarkt. 4 Binnen Letteren heeft Japanologie een uitstekende reputatie op gebied van het verwerven van digitale geletterdheid, en sinds het schooljaar van 2016-2017 wordt ook de master Japanologie een tweejarige master, met meer nadruk op stages en het opbouwen van praktische vaardigheden. Daarnaast is het mogelijk om tijdens een van de masterjaren al een attest als leerkracht Japans te bemachtigen. Als laatste wordt het behalen van een extra diploma - een extra specialisatieveld - ook sterk aangemoedigd. Over ervaringen in de bedrijfswereld kan ik zelf nog niet meespreken. Wel lijkt mij, zoals in elke richting, het profileren tijdens de studiejaren en het kweken van extracurriculaire competenties iets dat zeker niet verwaarloosd mag worden. Waar ik eigenlijk eerder op wil focussen binnen deze vraag is de waarde van deze richting (en andere richtingen binnen Letteren of zelfs breder, binnen arts ) niet op professioneel gebied, maar op persoonlijk gebied. Door het bestuderen van andere landen in al hun facetten, maar ook dankzij vakken als filosofie, antropologie, sociologie, enzovoort, leer je niet alleen meer over de wereld, maar ook over jezelf. \"Is Japan nog wel relevant?\" Enkele recente artikels over Japan die de Belgische mainstream media haalden 5 : Japanse keizer Akihito zinspeelt op aftreden President Obama bezoekt Hiroshima uitbreiding bevoegdheden Japans leger premier Abe verkleedt zich als Super Mario op slotceremonie in Rio Het klopt dat Japan niet meer wordt aanzien als het economisch powerhouse dat het ooit was, en sinds het barsten van een economische zeepbel vast lijkt te zitten in een langdurende recessie. Niettegenstaande blijft Japan de derde grootste economie van de wereld 6 , en wordt Tokio, juist zoals Londen in Europa en New York in de Verenigde Staten, gezien als het ingangspunt in het Aziatisch continent. Weeral is de werkelijkheid genuanceerder dan de overheersende stereotypes, en een sterkere focus wordt daarop gegeven in vakken als Japanse Politiek en Japanse Economie. Studenten Japanologie vandaag kiezen uiteraard ook niet langer uit dezelfde beweegredenen van studenten Japanologie 30 jaar geleden, die toen eerder economisch van aard neigden te zijn. De blijvende populariteit van de richting verraadt echter wel een aanhoudend belang en een niet onbelangrijke shift van economische naar culturele supermacht. Conclusie Er kunnen nog zoveel redenen voor- of tegen het volgen van Japanologie zijn, als je al gebeten bent door de Japan-microbe en je overtuigd bent dat dit de richting voor jou is zal het heel moeilijk worden om een andere richting met dezelfde passie en motivatie aan te vangen. Andere richtingen kunnen profijtelijkere carrièreopties opleveren, maar een richting als Japanologie biedt dan weer, hoe cliché het ook klinken mag, een heel andere soort rijkdom: die van persoonlijke verrijking. Het niet volgen van je hart, in functie van betere carrièreopties, kan leiden tot een spijt achteraf die niet meer in te halen valt. Niettemin, wees het nu een job in een Japans bedrijf in België, een functie ergens in Japan zelf, of zelfs iets geheel ongerelateerd aan de oorspronkelijke studies: een pad vind je zeker. Met een diploma Japanologie toon je niet alleen aan een hoop academische vaardigheden en een uitstekend aanpassingsvermogen te bezitten, maar belangrijker, je hebt jezelf kunnen ontwikkelen tot een rijper persoon die met een genuanceerde blik op de wereld kan kijken. Sterker nog, misschien hebben we in deze tijden van groeiende onverdraagzaamheid, zelfs juist méér Japanologen en mensen met een Bachelor en/of Master in Arts nodig! Graag wil ik concluderen met de vermelding dat als je kiest voor Japanologie, ongeacht je oorspronkelijke beweegredenen, en openstaat voor wat ik hiervoor beschreef, je in het gezelschap van gelijkgestemden enkele van de leukste jaren in je leven kan beleven, juist zoals de voorbije twee jaar al voor mij bleken te zijn. Meer lezen? Nippaku: Japanologie aan de KU Leuven, wat houdt dat nu precies in? : gedetailleerde beschrijving van onze richting door een van mijn senpai , zeker eens lezen! Japanse Studies, KU Leuven : de homepage van onze richting, met allerlei informatie voor (potentiëel) nieuwe studenten. Fushimi Inari Shrine by Stevie Poppe ( https://flic.kr/p/M4Kdmk - CC BY-SA 2.0) ↩ De optie die ik zelf volg. Daarnaast is er ook een economische minor met een hoop verplichte en keuzevakken rond economie, maar daar ben ik minder in thuis. Een meer complete lijst van vakken staat op de onderwijsaanbod pagina van KU Leuven . ↩ Cijfers gebaseerd op een grootschalig telling van de VDAB. Bekijk een interactieve grafiek over alle richtingen heen op: https://www.vdab.be/trendsdoc/schoolverlaters/detail/default.shtml ↩ Aan de andere kant levert de culturele minor, met vakken rond Koreaanse geschiedenis, cultuur en taal, ook een eerste aanzet tot een Koreanologie in België. Naast Cool Japan kent ook Korea al een geruime tijd een sterke shift naar soft power met haar export van pop-cultuur, beter bekend als de Korean Wave. ↩ Met de hashtag Japan lijken online kranten zelfs op dagelijkse basis te rapporteren over het land: http://www.standaard.be/tag/japan?page=1 ↩ Volgend op de Verenigde Staten en China, en gevolgd door Duitsland, Groot-Britannië en Frankrijk. Meer: https://en.wikipedia.org/wiki/List_of_countries_by_GDP_(nominal) ↩","title":"Waarom Japanologie?","url":"https://steviepoppe.net/blog/2016/09/waarom-japanologie/"},{"tags":"Studies","text":"So you want to: read a Japanese novel without ending up crying yourself to sleep realizing you know nothing , Jon Snow? learn Japanese by watching anime, but like, for real? create beautiful Anki sets filled with handpicked vocabulary, hidden furigana reading aids, AND crystal-clear audio pronunciations, all without spending days of mindnumbing copypasting? Welcome to the lovely world of Integrated Anki & Rikaisama ! Rikaichan , and it's Chrome variant Rikaikun , have already been widely established as incredibly helpful tools for reading Japanese online. Nevertheless, one major function remained missing still: a seamless integration with Anki for efficient vocabulary mining. A recent extension of the original Rikaichan, aptly named Rikaisama (it's a pun !), adds several new features including communication with the Anki API, Sanseido Web Dictionary ‘s J-J dictionary definitions, access to J-Pod101 ‘s 2 audiofiles, and several more 3 . Concretely, this means audio playback of tens of thousands of words and expressions as well as easy integration of new vocab into Anki. Despite these incredibly useful features, Rikaisama remains fairly unknown and unblogged about. To counter that, this blog serves as a brief tutorial on setting up a Rikaisama/Anki environment as well as demonstrating some useful real-life appliances. Rikaisama Download Like Rikaichan, Rikaisama is a Firefox plugin, available for download on their sourceforge download page (free, of course). If you're an avid Chrome supporter, this one might be worth switching for. After installation you'll have two new buttons at your disposal, either already visible at the top-right of your menubar, or in firefox' toolbar. The left one activates Rikaisama. I just leave it permanently open. The right one switches the Rikaisama lookupbar. I don't use this one often so I hide it in the toolbox myself, but for now we'll need it to access Rikaisama's settings. Open the toolbar and click the right-most icon to open those (after we're done, click the leftmost icon to deactivate the toolbar). Rikaisama's base settings are pretty self-explanatory, and I've left most of them to their default values. For our purpose, the Clipboard & Save and Anki tabs will be the most relevant. Set-up Rikaisama's homepage contains a crude, bare-bones set-up guide covering the basics of linking Rikaisama with Anki. It does however expect technical knowledge of it's readers, which I feel will averse some. I try to simplify things while still explaining why we're doing things, since it really is pretty easy to set-up. If you'd rather get straight to the point, just ignore the reasoning parts (or skip to 1.2.4. Usage to download a premade ankiset with matching notetype: all you'll have to do then is to change a few Rikaisama settings). Anki First, Anki will need an additional add-on as well in order to allow real-time import. It's ‘available' at Ankiweb's plug-in page , although actual installation is done in-app. Open Anki on your desktop, go to Tools → Add-ons → Browse & Install , and copypaste 2512410601 in the pop-up dialogue. Now, we'll create a new set to contain your Rikaisama-powered cards, a new note-type with fields corresponding to the info you'd like out of rikaisama, and finally a few card-types to test us on on visual recognition, on oral recognition, and on production. 4 Start by creating a new set, eg. rikai-vocab 5 . On Windows, press CTRL-SHIFT-N , or click Tools → Manage Note Types , to enter the notetype management screen. Click add , then ok on the next screen, to create a new note type. Call it Rikai (do note my excellent graphical skills as seen in the screenshot below ( ͡° ͜ʖ ͡°) )! Next, select the new Rikai note-type and click Fields . We'll rename the current front and backside as Expression and Meaning , and add two new Fields Audio and Notes (this one could be used for personal notes or example sentences). If you're interested in pitch accents, add a fifth field Pitch . Next, close this screen and click on Cards . We'll manage the different cards this note generates as well as it's make-up. We'll start with some basic layout. Add the following lines to the bottom of the middle Shared Style screen. For optimal learning, we'll keep word readings in kana as furigana displayed on touch/hover. This way learners are less likely to use them as a crutch. ruby rt { visibility : hidden ; } ruby :hover rt { visibility : visible ; } Next, click the + button twice to create two more card-templates. Next, rename (by clicking More → Rename ) templates Card 1 , Card 2 and Card 3 respectively as Recognition , Production , and Audio . Finally, let's wrap up our Anki set-up by creating the actual card's templates. Each card will question you on one field (the Japanese expression, the English translation and the Audio) and show the answer on the backside along with audio and any potential notes, if present. Your card's templates should look as follows: Recognition Front Template {{ furigana : Expression }} Back Template {{FrontSide}} < hr id = answer > {{Meaning}} < br > {{Audio}} {{#Notes}} < br >< br > < b > Notes: </ b > < br > {{furigana:Notes}} {{/Notes}} Production Front Template {{ Meaning }} Back Template {{FrontSide}} < hr id = answer > {{furigana:Expression}} < br > {{Audio}} {{#Notes}} < br >< br > < b > Notes: </ b > < br > {{furigana:Notes}} {{/Notes}} Audio Front Template {{ Audio }} Back Template {{FrontSide}} < hr id = answer > {{furigana:Expression}} < br > {{Meaning}} {{#Notes}} < br >< br > < b > Notes: </ b > < br > {{furigana:Notes}} {{/Notes}} If you added a fifth field Pitch , add <br><br>{{Pitch}} to the back templates of those cards. Mapping Now we'll enter our Rikaisama settings on Firefox and ensure our newly created note-type's fields match the ones in Rikaisama's anki settings. You'll have to make some adjustments in both the Anki and Clipboard & Save tabs, as documented below: Anki tab Save format : $d[$r]$t$n$t[sound:$a] Field names : Expression Meaning Audio If you added the pitch field, this becomes: Save format : $d[$r]$t$n$t[sound:$a]$t$p Field names : Expression Meaning Audio Pitch Make sure to mark the save audio checkbox . The field names field is pretty forward, it contains the field names of the note we just created in Anki. The Save format field however is a bit more complicated. It'll contain tokens or variables (similar to fields in your Anki note) available for each Japanese word hoverable through Rikaisama. Each field name must have both a corresponding token, marked by a dollar sign and a single letter (eg. Expression → $d ) as well as a token for empty spaces in between. To get our furigana, the kana reading must be encapsulated next to our expression (eg. $d[$r] ). The $a token contains just the mp3 filename. To get it to play in our cards, we require a correct format (eg. [sound:ちょうつがい - 蝶番.mp3] ), hence the [sound:$a] . Clipboard & Save tab Anki keeps all of it's assets, like audio or images, in a specific folder. Thus, we'll have to adjust the path these audiofiles are saved in rikaisama's settings as well. On a clean Anki install on windows, this folder will probably be something like C:\\Users\\your_name\\Documents\\Anki\\anki_username\\collection.media . When located, use that folder's path for your Saved Audio path. We'll also have to confirm our save format again in this tab. Just copy/paste the one you used in the other tab. I personally tag all rikai-created ankicards as such, this isn't necessary but it might come of use in your anki's browser one day. Dictionaries A final step in case you haven't used Rikaichan before, is to install some dictionaries files, available at Rikaichan's homepage . I personally use the Japanese - Dutch , 6 Japanese English and Japanese Names dictionaries, and sort them in those order in Rikaisama's configuration. Usage Now let's test our set-up! For Rikaisama to recognize which Anki set and which notes to use, we'll have to open anki and enter our set everytime we're on hunting spree. If you get a mismatch error, just click add and ensure that the selected type is Rikai by clicking on the current type and selecting the proper one (just click close again afterwards). Hover over these two words. A rikai pop with definitions should appear. 理解 ( りかい ) | 暗記 ( あんき ) (I'm not obsessed, I swear~) Now, while still hovering over them, type r (the Real-Time Import key) to import these words into your set. Hoorah! Note that Rikaisama by default does not allow duplicates, so if you try to add an earlier added word, you'll get an error message. I've exported my own copy of this example and uploaded if you want to compare or save yourself the work of creating the note template manually: Download : Example set Rikai If there's one downside to this method, it's that an audio reference will be added to your cards regardless if there's an existant audio recording online. This is especially the case with lesser known words or idoms: while reading Harry Potter I've added a few hundred of such cards. To remove these, just open Anki on your desktop computer and select Tools → Control Media . It will clear all the non-existant audio entries from your cards' Audio fields. Afterwards, click Tools → Empty Cards to remove all the empty oral-recognition cards. Appliances Internet This one goes without saying as that's pretty much the prime objective of this tutorial. If you're a relatively new learner, NHK provides simplified news articles and videos at NHK Easy News . I used these a lot near the end of my first year studying, and it's a neat way to stay up to date with what's going in Japan, or more generally in the world (frankly it's a bit awkward if you don't as student in cultural or social sciences). Novels 「言い方がまちがってるわ。ウィン、ガー・デイアム レヴィ・オーサ。『ガー』と長一くきれいに言わなくちゃ」 7 JNovelFormatter JNovelFormatter is a neat little tool by the developer of Rikaisama 8 that converts japanese literature in .txt format into clean parsed HTML files. Layout is fairly customizable, although I think the original settings are easy on the eye as-is (I like dark backgrounds when reading for hours at a time, makes me feel less like I'm gazing straight into a lightbulb). End of sentence dots get turned into bookmarkable anchors so you won't lose track of your progress. I highly recommend this method! I've used this approach while reading The Girl Who Leapt Through Time ( 時 ( とき ) をかける 少女 ( しょうじょ ) ) during our 読書 ( どくしょ ) クラブ ‘s book-reading sessions and just last week, as a kind of summer project, worked my way through the first Harry Potter (a surprisingly high difficulty but I know the original by heart so that helped heaps context-wise). As for resources, there's plenty to be found online. Light novels are commonly uploaded in text format and probably a good starting point for the more advanced learner. 9 I've heard Zero no Tsukaima ( ゼロの 使魔 ( つかいま ) ) and Kino no Tabi ( キノの 旅 ( たび ) ) are relatively easy reads, for example. 10 Aozora http://www.aozora.gr.jp/ , pretty much the Japanese Gutenberg project, freely hosts tons of public-domain books online. 11 Check out Natsume Soseki's classic Botchan as example . Their literary standards are a bit higher as the typical light novel so it's quite an adjustment, but great for those who're looking for easy-to-find, legally obtainable literature. Anime A really cool concept recently released is Animelon's multi-layer subtitled anime streaming web-app, akin to the Erin's Challenge video's (except with arguably way more interesting content: as of date there are over 60 series hosted, mostly all big names ranging from more recent hits as SAO and Attack on Titan to classics as Fullmetal Alchemist: Brotherhood and Clannad). If I were to recommend one to start with, I'd definitely pick Clannad. 12 The high-school setting means relatively easy and casual vocabulary (as opposed to, for example, SAO's highly technical and fantasy-related vocab you'll barely ever encounter in real life), while the voice acting's pacing is calm enough to pick up as relative beginner, and devoid of difficult accents. Check out their video demonstration below to see the various possibilities: What bothers me a bit is the legality of it all. They're currently keeping this site up as proof-of-concept in search of potential buyers but meanwhile they're hosting full series in HD quality \"for educational purposes only\". I'm not complaining but I hope they survive, since this service is golden, really. Gaming This one's a bit tricky still. The new web-possibilities since the implementation of the latest HTML-standard, HTML5, have given rise to a broad range of games running natively in your browser without the need of additional clutter such as Adobe Flash. Especially visual novels, a big thing in Japan, would be most suitable for our purpose, considering the large amounts of text. Except so far the online playable ones I've found were either already translated into English, or else of the early '90s abandonware eroge kind, so not what I was looking for (you'll easily find that online if that's your cup of tea). Another option is to set up your gaming environment in such a way it enables you to use these features. There's an active community of technically capable Japanese learners at Reddit and Koohii who came up with such a thing. I've yet to try this myself, and honestly, it's a bit bloated, but if you're dying to play visual novels and learn Japanese at the same time, this'll do the trick: Get Visual Novel Reader : it appears to be a mask to be run over an already installed visual novel, using OCR to capture Japanese text, parse it, and run it through some dictionaries ( Tutorial ). Use the Firgana Inserter Firefox Plug-in to automatically copy-paste dialogue from your clipboard, obtained dynamically through OCR by above means, to an empty Firefox screen. If you're running Firefox and your game side by side you'll be able to max up your visual novel ankisets in no time, just like this guy! Wait! There is more! The main goal of this post was to introduce a less known, but highly useful, Anki functionality by linking Rikaisama's excellent 13 pop-up dictionary with Anki's API, as well as show several possible appliances. If you've any further questions, feel free to check out the other articles in this series on Anki, or to leave a comment below. A Quick Guide on Using Anki (effectively) (in an academic context) Using Anki's API to contextualize your vocab cards with example sentences Making the switch: J-J definitions in your vocab cards Further reading AwesomeTTS for Anki : My approach uses JapanesePod101's vast audio library. Occasionally however I encounter words or expressions that have no native spoken audio recorded. If you want audio-completion, this open-source tool allows for text-to-speech in your Anki cards. I use this occasionally on full sentences or korean vocabulary, but the quality of the free TTS engines remains fairly primitive, so your mileage might vary. Learn Japanese Through Videogames : speaking of videogames, you could also look up videogame scripts ( セリフ 集 ( しゅう ) ) and vocab-mine from those. This guy wrote a decent blog on that. The recent Phoenix Wright spin-off Dai Gyakuten Saiban (a series I'm particularly fond of) has yet to be confirmed to receive a western release, so I'll have to brush up my legal vocab this way before playing. Image taken from the 2012 Japanese animated film Wolf Children by Mamoru Hosoda, used under Fair Use doctrine. ↩ A popular online language course podcast. They have podcasts ranging from newbie (mostly English) to upper intermediate (100% Japanese). I used to use these in the beginning as the added scripts are quite helpful for raising listening skills. The male, English speaking is notoriously difficult to stand, however, and despite most content being free, they have some iffy marketing techniques. Regardless, they recorded a dictionary's worth of vocabulary in high quality audio for Jim Breen's dictionary, so that's hella cool. Read more: http://blogs.japanesepod101.com/blog/2009/04/20/biggest-announcement-ever-edict-japanese-dictionary-now-with-audio-for-every-clip-must-hear ↩ Other useful features include pitch order, updated frequency lists, and EPWING dictionary support if you're into that. The full list is on their homepage. ↩ I'll assume concepts like notes and types are somewhat clear to the reader. If not, I refer to that particular section of my previous Anki article Creating your own cards… Efficiently ! for a more detailed guide on notes and setting up templates. ↩ I personally keep several sets containing rikai-powered cards. A set for each new book I read, sets for vocab related to my studies, and a set for whatever I come across online. I do this to keep my priorities in check: during exams I give less priority to keeping up to date with my books/misc vocab. ↩ Courtesy of Leuven University's very own Japanology department! More info on the Waran Jiten Japanese-Dutch dictionary at http://japansnederlandswoordenboek.org/index.php/Hoofdpagina ↩ The single most satisfying scene from the Japanese edition of the first Harry Potter novel. ↩ Actually, this guy made a lot of surprisingly helpful tools for learning Japanese, including the more popular subs2srs for creating Anki sets based on subtitles and video, and OCR Manga Reader, a manga reader with Rikaichan-like functionality using optical character recognition. Full list is at http://rtkwiki.koohii.com/wiki/Community_Tools ↩ I'll refrain from linking here as that's legally gray territory. ↩ Then again, Joyce's Ulysses is probably an easy read as well compared to the likes of Proust's In Search of Lost Time, so I'll come back to this statement when I've judged for myself. ↩ According to Wikipedia, they host over 10.000 works including both out-of-copyright or made freely available by the authors. Read more: https://en.wikipedia.org/wiki/Aozora_Bunko ↩ If you're watching Clannad: After Story afterwards, keep tissues at hand. ↩ Actually, while Rikaisama improves greatly upon Rikaichan, there's still some features I'd like to see implemented such as the ability to display sanseido-mode J-J as well as default J-E at the same time, or to select which definition to ankify. The developer set up a to-do list of sorts, but as it's a one-man hobbyist project I'll expect these to be implemented rather slowly. ↩","title":"A Quick Guide on Using Anki 2: an efficient vocab mining set-up with Anki and Rikaisama","url":"https://steviepoppe.net/blog/2016/09/a-quick-guide-on-using-anki-2-an-efficient-vocab-mining-set-up-with-anki-and-rikaisama/"},{"tags":"technical","text":"Due to my studies I (will) often use Japanese in my blog. As I gave some thought to typography and readability, I found the default appearance of Japanese text to be in stark contrast with the rest of my design. 1 To target specifically Japanese text, I wrote a small Markdown-Python extension for use in static blog generators as Jekyll and Pelican (or pretty much anything that utilizes Markdown-Python to parse Markdown in HTML) and embed such text in a span with the language attribute set to Japanese. The added, and probably more important bonus, aside from styling and semantic reasons, is that this method counters the negative effects of Han unification in so-called CJK-languages. Download I've added the extension on it's own repository on my github for anyone interested, but as it serves it's purpose for me as-is I have no further interest in maintaining it at the moment. 2 Installation Copy the japanese.py script into your python-markdown extension directory. If you're using Pelican as static site generator, open your project's pelicanconf.py and add 'japanese' to the MD_EXTENSIONS list: MD_EXTENSIONS = [ 'japanese' ] Usage Using a simple regular expression (\\{\\{)(.+?)(\\}\\}) , the extension treats double {} brackets as span tags with a lang=\"ja\" attribute. {{ 読書クラブ }} will output < span lang = \"ja\" > 読書クラブ </ span > Example 1 (fonts): just compare 読書 ( どくしょ ) クラブ (custom) to 読書 ( どくしょ ) クラブ (Meiryo) to 読書 ( どくしょ ) クラブ (MS Gothic default). 3 Example 2 (unihan): compare the Chinese to Japanese characters: 隆 ( 隆 ), 誤 ( 誤 ), 直 ( 直 ). 4 Styling Although it's a bit of a risk performance-wise, I'm quite a fan of Google's free webfonts. 5 Due the complexity of the Japanese character-set, development on these have been slow 6 , but Google's Noto Font is getting quite performant and with the Japanese font set supporting near 7000 characters, it should pose no problem for most webprojects. Since it works better, typography-wise, with the rest of my fonts, I use this one over fonts as Meiryo that're more widespread across all platforms. Using the CSS below, I ensure max compatibility by using Meiryo and others as fallback if the page can't connect to Google's font API. @import url ( https :// fonts .googleapis.com / earlyaccess / notosansjapanese .css ) ; [ lang = \"ja\" ] { font-family : \"Noto Sans Japanese\" , \"メイリオ\" , \"Meiryo\" , \"ヒラギノ角ゴ Pro W3\" , \"Hiragino Kaku Gothic Pro\" , \"ＭＳ Ｐゴシック\" , \"MS PGothic\" , Sans - Serif ; font-weight : 100 ; font-size : 95% ; } Further reading http://www.growingwiththeweb.com/2014/03/languages-and-chinese-characters-on-the-web.html http://nimbupani.com/declaring-languages-in-html-5.html https://design.studio-umi.jp/blog/google-web-font-japan http://kanjialive.com/2013/04/selecting-a-better-japanese-font-for-windows-web-browsers/ This is less so on mobile devices. Most Windows web browsers default to MS Gothic, lacking anti-aliasing found in newer fonts as Meiryo, and require some manual adjustments. For maximal compatibility, I prefer to do this in-site. If no further customization is necessary, just adding Meiryo as fallback font in the page's font-family is sufficient, eg. font-family: Arial, Helvetica, Meiryo,sans-serif; . ↩ A possible extension could be one where different regular expressions test for different languages and thus deliver different lang attributes. If I find the need for that on my own blog (eg. Korean), I'll update this. ↩ For furigana support I use a slightly editted version of an existing MD extension available at https://github.com/djfun/furigana_markdown . ↩ If a multilingual page uses only Japanese, it's sufficient to put a Japanese font as fallback in the body's font-family. If occasionally Chinese or Korean characters are used as well, this approach, aside from semantic benefits, remains more recommended. ↩ I use Quicksand and Poirot One for all my latin-based text on this page, for example. ↩ Adobe's competing, subscription-based Typekit apparently offers a wider range of Japanese webfonts for anyone interested: https://typekit.com/fonts?script=japanese . ↩","title":"Parsing Japanese Text in Markdown-Python for Stylizing and Semantic Purposes","url":"https://steviepoppe.net/blog/2016/09/parsing-japanese-text-in-markdown-python-for-stylizing-and-semantic-purposes/"},{"tags":"Personal","text":"Earlier this year I, alongside several other second year Japanology students at my university, participated in a small \"tell an interesting story\" speech contest organised by Kobe University. This week we were informed the videorecordings of these had been uploaded on the contest's website and were available for all to watch 2 . My story is a classic \"awkward Japanese language mix-up\" anecdote on a visit to a Japanese elementary school in Brussels, which I'll touch upon in this post, alongside the embedded video. ( 日本の方、あまりよくないんですけど、もしよかったら見てみてくださいね！ ) Edit : just found out I somehow managed to win first prize out of all the foreign contestants!! This is so cool to hear! Thanks for the cookies, Kobe University! :D The Video This video, along with my participation entry, is available at speech-data.jp . The story The story really isn't that interesting and a bit embarassing, but here goes anyway! As second year students Japanology, our class participated in an excursion to a Japanese elementary school in Brussels: a fun opportunity to practice our language skills as well as have some fun playing games and learn about cultural differences and customs. The event even warranted a small post on the JSB 3 section on yahoo.co.jp ! In advance of this trip, we split our class in several groups, each preparing a presentation or activity related to our country. Several students in our group live in Antwerp, thus we thought it fun to hold a small presentation on the famous Antwerp folklore story of Druon Antigoon , an evil giant guarding a bridge and exacting an exorbitant toll of those wishing to cross. Failing to cross meant getting your hand chopped off and thrown into the river 4 . A tad dark, but it worked well with a popular Belgian children's game we thought fun to teach them, and in addition, there's some really nice chocolate treats based on this tale we wanted to distribute afterwards. The game The game is a variation of a classic tag game called \" schipper, mag ik over varen? \" (Eng: \" Skipper, may I cross? \") and usually played on a school's courtyard or in a larger PE classroom. To play, the territory gets divided into two and the students line up on either side. One or two volunteers play the role of \"skipper\" or \"boatsman\" and line up in the middle (I drew a quick MS paint diagram below, don't judge). Each round, those on the border are expected to reach the other side. Those playing the role of skipper make up a rule that has to be upheld to attain passage. Rules to pass could be anything: those wearing glasses, those skipping on one leg, etc. Not being able to uphold these rules however means running past the skipper and not being caught: if you're tagged, you become a skipper as well. The more skippers, the more difficult the game becomes. The shame Me and a classmate played the role of skipper and did pretty well making up rules in Japanese. Near the end however, I noticed several of the remaining players wearing pink pants. \" I should definitely use this information for the next skipping rule \", I thought to myself. Now, the common word for pants in Japanese is ズボン ( zubon ), probably one of the first words we learned. Except during the heat of the moment I mixed this one up with another Japanese word very similar to the english \"pants\". The end … Long story short, in front of not just my own teachers but all of the Japanese staff present, I asked a bunch of 12 year old girls to pass if they wore pink パンツ ( pantsu ), a word commonly reserved for underwear. Hope I won't make that mistake again. 5 Nikko Bridge by Stevie Poppe ( https://flic.kr/p/LKfDn7 - CC BY-SA 2.0) ↩ These videos can be found @ http://www.speech-data.jp/chotto/2015F_sub/ ↩ Short for the J apanese S chool of B russels, read more on this on Wikipedia ! ↩ Lucky for us Antwerp citizens, a young soldier named Brabo cuts of the giant's hand in return and casts it into the river, leaving us with some nice statues near the city square and an interesting story to tell tourists. Read more on this on Wikipedia ! ↩ I was confronted with a loud 「えええええええぇぇぇぇぇぇッ！！！」 coming from these girls' general direction. Everyone else looked particularly amused however, so that's something at least. ↩","title":"Visiting a Japanese Elementary School - An (Awkward) Experience to Remember","url":"https://steviepoppe.net/blog/2016/08/visiting-a-japanese-elementary-school-an-awkward-experience-to-remember/"},{"tags":"Personal","text":"After a long, stressful first semester exam-period, I spent my brief time off traveling to two completely opposite places I've been wanting to visit for a very long time: Rome, Italy and Iceland : one of the coldest winter destinations I could imagine, but a place of stunning natural beauty. Over the past years, Iceland has gained somewhat of a reputation for its hipster population and excellent music scene (both true), but its true strength remains in its wild, barren landscapes: sceneries that often came over very alien to me. What follows is our brief itinerary through this beautiful country, with plenty of eye-candy to go along with it. Brief history Iceland, a volcanically active island close to the Arctic Circle, was first inhabited by in the 9th century by, traditionally claimed, vikings or Norwegian settlers. Most of present-day Icelandic culture finds its roots in its Scandinavian heritage, and even now is mostly famous for its medieval sagas and traditional literature and cuisine, as well as its language closely related to Old Norse. As the icelandic plateau is one of the newest in the world, the surroundings closely resemble what our continents must've looked like millions of years ago. Agriculturally wise, almost everything is imported from countries as Canada, as the only native growths here are limited to bleak bushes. Itinerary Having only a few days off in-between my exams and the start of my next semester, my mom and I were very limited in our itinerary. Even more, neither of us had a driver license at this point, so we were forced to book several tours to show us around (a thing I generally dislike, but actually ended up really pleasant). We stayed several nights in Reykjavik as day-trips to iconic views were easiest to reach. Golden Circle Tour On our first proper day, we took a tour leading us through the Golden Circle , the most popular tourist route in iceland. the host driving us around was an elderly man taking great pride in his viking roots and often talked of bygone farmer days and Icelandic folklore. On our way to our first hallmark, we encountered these beauties: Geysir Geysir is the geyser the English word is derived from and erupts about every 10 minutes, hurling boiling water up to 70 metres in the air. Gulfoss Gulfoss , icelandic for \"Golden Falls\", is an iconic waterfall located in the midst of a large canyon. National Park Parliament Thingvellir , a national mark in southwestern Iceland, lies in a valley known for its Althing , the national Parliament. It was established in 930 and is generally considered as the founding point of the Icelandic nation. It held sessions until 1798, and is thus one of the longest-running parliaments in the world. Northern Lights In the evening, we took a bus to a more desolate spot outside of the city and waited for polar activity. We were extremely lucky to have a clear sky in this period (heavy snowstorms hit Iceland shortly before our arival as well as on our last day) and after a few hours of waiting were graced with ghostly green shimmmers dancing in the dark (excuse my attempt at sounding poetic). Alas my camera was not strong enough to record any of this, so you'll just have to take my word for it's magic. Second Tour The next day, we took another tour driving us around several other landmarks, including the famous volcano Eyjafjallajokull which erupted in 2010. Our host, an extremely pragmatic man, felt no need to recite childhood memories and instead informed us on current-day isues such as the economic crisis, the political system and farmers' daily lives. Eyjafjallajokull Vatna Glacier Fans of Game of Thrones might recognize Vatnajökull , the largest ice cap in Iceland, as a scene in the series' second season. The barren surroundings contrasted strongly with the bright, blue reflection of the enormous mass of ice in front of us. Black Sea Our last stop was the Reynisfjara shore , a black pebble beach near an impressive cliff. A snowstorm hit us around this period and walking around was extremely difficult. Reykjavik We spent one day walking around Iceland's capital, a city with a population of around 130,000. Bearded men walk around wearing lumberjack shirts in the middle of the winter, and blend in well with the picturesque and colourful houses as well as the various boutiques and stores that could only be referred to as being hipster. We visited spots as the Reykjavic Concert & Conference Center, known for it's beautiful glass architecture, and the Church of Hallgrimur, the largest church in iceland. We had some great food and shopping around this place, but by the time we were ready to depart to our final destination, another heavy snowstorm made its appearance. Thanks to a kind by-passer we reached our bus-stop in time for a drive to Kevlavik, a small village close by the airport. As our airplane left quite early the next morning, we felt it'd be safest to spend our night nearby. Kevlavik Unfortunately, our bus stop was pretty far from our actual destination, and as Kevlavik was formed around and out-of-use military base, nothing really stood out as bed & breakfast kind of place. By this time, the storm reached a peak with winds reading over 80km per hour, and walking through either 30cm of snow or slippery ice made this an impossible mission, especially since we were all by ourselves. At one point we were literally clinging to the pole of a traffic light for 10 minutes until a car passing by was kind enough to give us a ride to our B&B. Safe to say, we didn't go out again for sightseeing. Music When traveling, I make it a habit of finding good music by listening to local radiostations or asking recommendations to people I meet in hostels or bars - It's my own personal souvenir and sticks better as regular touristic souvenirs. Despite a relatively small population, Iceland (particularly Reykjavik) is well known for having an excellent music scene, with such world-class acts as Bjork , Sigur Ros and Of Monsters and Men . I came across this trip's band, Kiasmos , while visiting a bookstore and swiftly fell in love with the duo's experimental, almost drone-like ambient electronica. One of the duo's members, Ólafur Arnalds , has already built a name for himself mixing his classical piano background with electronica and is definitely one to remember as well! Conclusion It's a shame we had such a short stay, as Iceland came over as a beautiful country unlike any other, with a rich and fascinating history and splendid alien-like landmarks. Our personal biggest drawbacks were a lack of money and driving licenses; I would definitely return if neither of these formed a problem. Gallery .embed-container { position: relative; padding-bottom: 56.25%; padding-top: 30px; height: 0; overflow: hidden; max-width: 100%; height: auto; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; } Iceland Winter by Stevie Poppe ( https://flic.kr/p/NskHGR - CC BY-SA 2.0) ↩","title":"Travels: an Icelandic Winter","url":"https://steviepoppe.net/blog/2016/08/travels-an-icelandic-winter/"},{"tags":"Personal","text":"After a long, stressful first semester exam-period, I spent my brief time off traveling to two completely opposite places I've been wanting to visit for a very long time: Iceland and the historic city of Rome, Italy , cradle of one of the greatest civilisations ever. As a kind of early valentine, my girlfriend and I decided on this 4-day city trip to recharge our batteries and spent some much needed time together; looking back, it really did turn out a city that could only be described as a living, breathing open-air museum. What follows is our brief itinerary through this charming city, with plenty of photographs to go along with it. Brief history Where does one start! Rome, Italy's capital and largest city, has been an extremely influential city for nearly three-thousand years. What is now a global city popular for it's fashion and design was once a small village on top of a hill that through a series of fascinating military and political events became center of a vast empire and location of Catholicism's founding. Plenty of historical locations have been destroyed following Italy's rise of Facism and role in the second World War, but the historic centre, Unesco World Heritage, remains as if untouched by time. Itinerary Being limited in time, we spent all our time exploring the historical center of Rome and the Vatican. We spent 3 nights in a lovely bed & breakfast about 15 minutes away from the historical center, which was, due being located in what might might be perceived as a shabby neighbourhood, extremely well priced. Day 1 We spent our first day strolling around the city's historical center and experiencing some of the more popular destinations such as the famous Spanish Steps square and Trevi Fountain . As fans of English Romanticism (including poets as Byron , Shelly and Keats we spent a bit of time in what is now a museum dedicated to Keats: the Keats-Shelley Memorial House museum . We concluded our evening having the most cliché dinner one might expect: pizza and tiramissu (I regret nothing). Day 2 Our second day was mostly centered around rome's ancient Colosseum , Palatine Hill and the massive Roman Forum : home to what was one of the most powerful governments in the world. Beautiful ruins rich of history made this area an unforgettable experience. It turns out this area is popular amongst conservatorium students as well. Excellent, sunny weather (in the middle of winter!) and a clasical violist nearbly reciting Vivaldi made for a lovely picknick and just a tiny bit of romantic dancing~. Later in the evening we visited the Pantheon , a basilica dating back to 27 BCE, and architecturally quite impressive. Day 3 Our 3th full day was mostly focused on the Borghese Gardens (we ended up renting a rowing boat! :D) and it's excellent art museum including works of Bernini . Turns out ordering a chocolate milk in Rome will net you a solid chocomousse-like dessert. Cultural differences! Day 4 Our 4th and last day, a sunday, was an excellent time to visit the Vatican City and gain a potential bar-bragging story by experiencing a Pope Francis speech live. The Sistine Chapel ‘s queues are legendary and despite being out of season, today was not an exception. We could've easily qued for 4 hours so we wisely decided on admiring St. Peter's Basilica instead. I'm not particularly religious, but the general atmosphere in Vatican City was quite enjoyable and reminiscent of that felt at music festivals: a small band was performing live music while an enormous crowd, including lots of youngsters, lined up to see the Pope's speech. Not speaking Italian or being religious made me feel slightly out of place however. Music When traveling, I make it a habit of finding good music by listening to local radiostations or asking recommendations to people I meet in hostels or bars - It's my own personal souvenir and sticks better as regular touristic souvenirs. This trip's band is Zu , an experimental band hailing from Rome and often defined as being a mix of dark jazz (whatever that might be~), math rock and noise. It's definitely not an easy listen, but highly atmospheric and I've grown surprisingly fond of it. The following song is a collaboration with fellow noise-jazz band Il Teatro Degli orrori . Conclusion Calling Rome a living, breathing open-air museum is certainly no overstatement. One might wander for hours through the historical center's alleys and sidestreets and still discover new beautiful sightings and hidden surprises. Italian food is famous across the world and rightly so. Restaurants in the historical center are generally concidered tourist traps, but just a few minutes of extra walking took us to great, affordable destinations. Finally, and this is probably accountable for traveling out of season but despite being such a popular destination we've hardly ever felt overcrowded or had shady figures approaching us at touristic viewpoints, as we've experienced in places as Lissabon or Paris. All in all, Rome ended up a perfect romantic citytrip destination and highly affordable even for the poor students amongst us! We spent 4 days which felt fine but we could've easily stayed longer and still discover more. Gallery .embed-container { position: relative; padding-bottom: 56.25%; padding-top: 30px; height: 0; overflow: hidden; max-width: 100%; height: auto; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; } Rome Skyline by Stevie Poppe ( https://flic.kr/p/LeGNpM - CC BY-SA 2.0) ↩","title":"Travels: Romance in Rome","url":"https://steviepoppe.net/blog/2016/08/travels-romance-in-rome/"},{"tags":"Technical","text":"Footnotes are a classic staple in any writer's toolbox and allows them to, in an unobtrusive way, citate sources or display additional information not directly related to the original argument. Yet I feel online footnotes, through the way they're often implemented imitating printed media footnotes, come over quite counterintuitive by forcing the interested reader to disrupt his reading flow, and by failing to make use of today's extensive webdesign posibilities. As I royally use footnotes in my markdown writing workflow 1 I figured I'd get acquainted with the Pelican documentation a bit and write a small unobtrusive CSS pop-up plugin to display these on hover for those devices that support it. 2 My solution is pretty rough and based on the way Python-Markdown parses markdown into HTML. As it's a quick ‘n dirty workaround untested with other parsers, I have no intention to further maintain this code so feel free to use it however you'd like. def content_object_init ( instance ): if instance . _content is not None : content = instance . _content soup = BeautifulSoup ( content , 'html.parser' ) if 'sup' in content : footnotes = soup . find ( class_ = \"footnote\" ) . find_all ( 'p' ) footnoteref = soup . find_all ( class_ = \"footnote-ref\" ) for index , item in enumerate ( footnotes ): footnoteref [ index ] . parent [ 'class' ] = 'popup_footnote' tag = soup . new_tag ( 'span' ) tag . append ( BeautifulSoup ( item . decode_contents (), 'html.parser' )) footnoteref [ index ] . insert_after ( tag ) instance . _content = soup . decode () def register (): signals . content_object_init . connect ( content_object_init ) For simplicity's sake I use the BeautifulSoup library to locate all footnote references and their respective footnotes. Then I loop through them and copy the contents of the footnote in a ‘popup_footnote' span I append to the footnote reference container. Styling is done in CSS. Below is my markup. I use left: 50%; transform: translate(-50%, 0); to center the absolute-positioned pop-up over the footnote reference. sup .popup_footnote span { text-align : justify ; z-index : 10 ; display : none ; padding : 5px ; line-height : 16px ; opacity : 0 . 9 ; border - radius : 4px ; box - shadow : 5px 5px 8px #D4D4D4 ; top : 10px ; left : 50% ; transform : translate ( -50% , 0 ); position : absolute ; width : 250px ; } sup .popup_footnote :hover span { display : inline ; color : #111 ; border : 1px solid #eaeaea ; background-color : #fffcfc ; } The downside to this CSS-only implementation (next to having double content in your markup) is that it fails to respond well to responsive design. Fixed-size pop-ups relative to the footnote pointer could result in a potential screen overflow. If this is an issue, the only alternative is using jquery and calculate the position of your reference relative to the window border and use this to calculate an ideal pop-up location. Of course if you're relying on the jquery library either way you might as well use that to copy the footnote on hover instead of above's solution. For such an example, I recommend ignorethecode.net's solution . The difficulty writing web-content with footnotes is distinguishing footnotes or direct links. I generally draw the line between source citation as footnote and useful information as direct link. ↩ Using :active to substitute the lack of proper hover on touch devices wouldn't be effective as these pop-ups display over anchors. A dirty solution would be to use media tags and keep display:none for mobile device widths, but with the blurring of lines between touch and mouse input devices lately this is not foolproof. ↩","title":"Pelican Plugin: CSS-only footnote pop-up","url":"https://steviepoppe.net/blog/2016/08/pelican-plugin-css-only-footnote-pop-up/"},{"tags":"Personal","text":"Earlier this year, me and a couple of friends decided on a summer roadtrip throughout the Deep South, the most southern states of the USA. As we have a shared history of playing in bands or writing music together, we thought it cool to purchase some second-hand instruments and travel through the most musically relevant of the USA states. This short blog covers our 3-week itinerary, with plenty of pictures to go along with it. Brief history The Deep South refers to the seven slave states that originally teamed up to form the Confederate States of America. The historical dependance upon agriculture and labor of African-American slaves (as well as the proximity to Cuba and Mexico) means a large present-day ethnic minority of both African-Americans and Hispanic Americans, and a more apparent cultural mix. Therefore, parts of this particular region are also informally called Black Belt (as well as Bible Belt). Itinerary We rented a relatively cheap car large enough to fit the five of us and our luggage. The car looked like a limousine in size but paled in comparison to the cars driving around us. As most of us are still students, we left late june, straight after our finals. The summertime in the South is described as being relentlessly tough, so we made sure to have proper airconditioning and plenty of water available at all times. Florida Miami After a pleasant 8 hour flight, we arrived at Miami International Airport in Florida. Despite the late hour it still took us around 3 hours of queuing just to get through border control. On our way out we passed about two fastfood chain a minute, as well as several drive-thru gun shops and pharmacies, and big billboards advertising triple-bypasses. Interesting . Everglades We spent some time exploring the everglades, a natural region of tropical wetlands with a large variety of flora and fauna. After passing an alligator crossing the road, we decided on staying in our car for most of the trip. Key West The Key West is the most southern island of the Florida Keys as well as the most southern city in the USA. The area has strong Cuban influence and is generally known as a tropic nightlife paradise. We spent some time at one of the beaches but found the area too crowded to our liking. Panama City Beach After an incredibly long drive, we halted in panama City Beach and spent the afternoon and evening in a natural park. At this point, we realized cities in the USA don't have city centers similar to the German city-model popular in Europe. Thus we could never just drop our car somewhere and spend the day walking around. With the upcoming presidential elections most people we met were incredibly keen on talking politics. In the natural park, we met an elderly man who, after inviting us for a picknick with his family, tried to convince us President Obama was a muslim destroying the United States with his socialist plans and support for muslim terrorists. Actually, the media-portrayal of the elections as a whole felt like a populized bread and games - unsurprising as television channels are private-owned and heavily sponsored by lobbyists. Alabama After a long drive through the scenic beauty of Alabama, we spent a short night in major port city Mobile . I particularly enjoyed the thick accents spoken here, reminding me heavily of the 1994 movie Forrest Gump , which takes place around this area. Louisiana Louisiana was one of the more interesting states we've visited, with a strong Cajun and Creole influence present in both cuisine and culture. It's unfortunate that after eleven years, the scars caused by the notorious Hurricane katrina are still very visible. Lafayette Lafayette is a pretty small town with a lively outgoing scene. We watched some Americana bands perform in a very rustique bar filled with heavily tattood bikers; the whole thing felt like a scene straight out of popular Southern Vampire series True Blood. New Orleans New Orleans is known as giving birth to jazz music in the USA and thus couldn't be left out of our itinerary. We stayed close to the famous French Quarter and spent our first night in bars around Bourbon Street . As first impressions go, that one's a downer. The place reminded of a sleazy red-light district overrun by tourists, while the smell was unbearable and reminded of a mixture of sewer and cannabis. In hindsight this makes sense, historically parts of the French Quarter served as a red-light district, popular for drinking, gambling and brothels. New Orleans, as most of Lousiana, knows a strong Voodoo culture amongst the creole population (descendants of French or Spanish colonial settlers, often with African or Native American ancestry as well). One of the famous practitioners, Marie Laveau, is buried in New Orleans and her grave became a famous tourist attraction. Frankly, the voodoo culture felt very exploited, and someone we met of Creole descendant mentioned that through modernisation plans, very little of the actual Creole voodoo culture remains in tact. New Orleans has plenty of swamps and bayous. We took a tour through some of them, which was pretty cool. Texas Texas, the second largest state in the USA and bordered by Mexico, has a long and colorful history culminating in an extremely strong independant attitude today. Thanks to the wonderful people and incredible sights, we've thoroughly enjoyed our in this state and extended our stay by almost a week. Houston On our way to the state capital, we passed through Texas' largest city and home of NASA's Mission Control Center . As sci-fi fanboys, we couldn't not visit the space station. It's a bit unfortunate around this time several violent protests broke out following the shooting of an unarmed black man by a police man, and later on the shooting of several police officers. Austin We've often heard Austin is a more liberal and alternative city with a large college student population. For this reason we wanted to spent the 4th of july here as well our friday and saturday night out. Our stay here didn't disappoint. Almost all of the bars around here had Jenga games on their terraces. On a particular night, me and two others were on a roll and built a rather large tower, to the point some bystanders started filming and taking pictures. Several time that evening we were approached as \"Oh dude you're the Jenga boys, right?\" - Which was frankly not the reputation I was hoping for. One of our best meals was spent at a family-style barbeque restaurant nearby Texas, The Salt Lick BBQ, which we had already heard about before our trip after it went viral on the itnernet for their specific style of cooking. Another good memory food-wise was a Korean BBQ in the center of Austin. Not exactly very American, but I finally get the hype. Big Bend National Park Despite being relatively unknown, Big Bend National Park turned out to be the most breathtaking place we've visited. As it lies on the direct border with Mexico, the area has a distinct desert-like environment with fitting flora and fauna. We often came across snakes, lizards and scorpions, as well various spiders and insect I'd rather avoid. Nashville, Tennessee Nashville, the capital of Tennessee is well known as the center of the country music industry in the USA and gave birth to famous musicians as Johnny Cash, Willie Nelson and Roy Orbison, or even more recently Miley Cyrus. We spent some time on Broadway Street , popular for bar hopping (or \"honky-tonking\") along various country-music venues. It's a pretty touristic place (we actually passed famous conservative Dutch politian Geert Wilders) and some locals drove us to 5-point , the local outgoing district with a vibrant nightlife. Music When traveling, I make it a habit of finding good music by listening to local radiostations or asking recommendations to people I meet in hostels or bars - It's my own personal souvenir and sticks better as regular touristic souvenirs. This trip's musician is the Nashville born Hank Williams III , a multi-instrumentalist and grandson of famous honky-tonk / country musician Hank Williams. He succesfully blends his country and honky-tonk roots with punk rock and metal, and we've often played his albums on our trip. Conclusion A first surprise was the enormous influence of American pop-culture on our daily lives: when I first arrived I felt a certain nostalgia despite having never visited the USA before. Yet even more surprising was the spatial planning in these states: we've had occasions of staying at a certain hotel with a certain lay-out and several particular fastfood chains nearby, getting up at 7 and driving over 14 hours over straight concrete roads, just to arrive at the exact same hotel with the same fastfood chains surrounding it. It occasionally felt like a giant simulator with the copy-paste function used a bit too often. Public transport, especially interstate-wise, is really lacking. A young couple we talked to told us the car-industry succesfully lobbied against Obama's plan to introduce a European-style train-network. Even more, with an outrageous amount of advertisements and national flags hanging around, a sense of national identity is more heavily engrained as in Europe. Nevertheless it was a thoroughly enjoyable trip. We achieved our goals of playing music on the road, and most of our evenings were spent socializing with locals or listening to local bands perform. People were generally incredibly warm and interested and often invited us over for dinner or drinks. Speaking of which, I probably gained over 10 pounds eating hamburgers, bbq and various kinds of fried food. Gallery .embed-container { position: relative; padding-bottom: 56.25%; padding-top: 30px; height: 0; overflow: hidden; max-width: 100%; height: auto; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; } Desert by Stevie Poppe ( https://flic.kr/p/MbXtHF - CC BY-SA 2.0) ↩","title":"Travels: roadtrip through the Deep South","url":"https://steviepoppe.net/blog/2016/08/travels-roadtrip-through-the-deep-south/"},{"tags":"technical","text":"I've been thinking on maintaining a blog for a while now and had already stacked up a pile of writings ready to post. A long summer break allowed me enough free time to sit down and get started on the technicalities; a process a bit more complicated as initially expected but worth it in the long run. This blog serves not as a tutorial on making one with Pelican (I'll get to that eventually), but as a brief log on my reasoning and thought process during creation. Blogplatform Deciding From the outset I tried to steer away from heavy content management systems such as Drupal or WordPress . They're easy to work with and take a lot of work of your hands, but a serverside database means too heavy a load for what's basically a smallscale personal blog, and several unnecessary security risks on top. 2 The tech-hipster in me opted for a DIY approach with full control over both content and design. Static blog framework wise there are several popular options, but as I'm more accustomed to the Python programming language through other applications, I ended up choosing for Pelican over the more widespread Ruby -based Jekyll . An added value of managing my blogs clientside and delivering small sized static pages is the ease of finding an appropriate host (I host my pages on GitHub Pages while serving larger files through Dropbox) and a seamless integration in my Markdown -based writing workflow. 3 Set-up The initial set-up is relatively simple, as installation and basic generation is done through command line, and content written in Markdown , AsciiDoc or reStructuredText 4 gets served as stand-alone pages or articles. There's a wide choice of existing templates , but further customization requires some working knowledge on webdesign as well as, preferably, on basic programming concepts (Pelican templates are created using the python-based Jinja2 , allowing for template logic and inheritance). Needless to say, hosting on GitHub Pages requires knowledge of Git , but that's really not a skill learned in vain as the concept of version control applies well to writing important papers too. Development Getting acquainted with these tools can be time consuming. Luckily Pelican's well documented , and there are plenty of tutorials out there, as well as hundreds of working examples hosted on GitHub available as reference (the backbone of my template is a heavily modified Plumage theme). I prefer a minimalistic layout easy on the eye, and steered clear of unnecessary clutter, but with the advent of visual blogging 5 I figured I'd integrate some graphical elements, such as article banners (that's the extent of it really, I'm not much of na artist), as visual content engages the reader more easily. One easily overlooked design problem is ensuring responsive webpages for the ever increasing mobile internet traffic 6 , but with easy support for Sass , or just using Twitter's Bootstrap framework, this comes pretty naturally. Finally, implementing additional features is pretty easy too. There's a wide range of existing plugins for features like searching, minifying assets, table of contents and comments (using the third-party Disqus blog hosting service). Hosting GitHub has allowed free hosting for static personal or projectsites on GitHub Pages for a while now. This boils down to creating a new repository with your username and GitHub url ( steviepoppe.github.io ) and hosting your pages there. I created an additional source branch to host all my sourcefiles, use ghp-import to place my output files in a seperate branch, and force push that to the master branch on GH Pages. 7 pelican content - o output - s publishconf . py && ghp - import output && git push - f origin gh - pages : master So far GitHub's SSL certificate only covers *.github.io domains, there's no support yet for custom domains. Thus as final step after having set up my custom domain, and as an additional security layer, I use CloudFare to secure part of the connection and enroll some further optimisations. Conclusion While further customization requires some technical experience (or at least the proper mindset), I believe the base set-up is easy enough for anyone to learn and allows for more control over your own content and a smoother workflow as you would have relying on big CMS systems. Any extra skills learned will definitely come in use as digital publishing, webdesign and working with Git or other forms of version control become more and more basic skills anyone should possess. In retrospect, Jekyll appears to be an easier option for beginners with it's widespread usage, but both Jekyll and Pelican achieve the same thing, so this is personal choice really. I'll end up writing a full step-by-step beginner's guide on setting up Pelican and hosting on GitHub Pages eventually, but for now I'll post several decent tutorials below. Further reading http://arunrocks.com/moving-blogs-to-pelican/ http://cyrille.rossant.net/pelican-github/ http://duncanlock.net/blog/2013/05/17/how-i-built-this-website-using-pelican-part-1-setup/ http://guizishanren.com/guide-to-set-up-github-page-and-pelican/ Icelandic Sunset by Stevie Poppe ( https://flic.kr/p/M83mKT - CC BY-SA 2.0) ↩ Burnett, Brett. 2015. \"Why Did We Migrate from Drupal to Jekyll?\" Text. The BHW Group. https://thebhwgroup.com/blog/jekyll-drupal-wordpress ↩ O'Nolan, John. 2015. \"The Ultimate Guide to Writing & Publishing with Markdown\". Ghost. https://blog.ghost.org/markdown/ ↩ All three are open, lightweight markup languages with a heavy focus on readability through seperation of content and layout layers. ↩ Fanguy, Will. 2016. \"The Amazing Evolution of Visual Storytelling: Blogging, Instagram, Snapchat, and the Future\". Business 2 Community. http://www.business2community.com/trends-news/amazing-evolution-visual-storytelling-blogging-instagram-snapchat-future-01557833 ↩ ‘ the amount of mobile traffic now accounts for more than half of total internet traffic ‘ \"Cisco Visual Networking Index: Global Mobile Data Traffic Forecast Update, 2015–2020 White Paper\". 2016. Cisco. http://www.cisco.com/c/en/us/solutions/collateral/service-provider/visual-networking-index-vni/mobile-white-paper-c11-520862.html ↩ I'm doing this manually through command line for now, but there's several automatisation options including using Travis-CI for the more hardcore blogger. ↩","title":"Hello World - About This Blog","url":"https://steviepoppe.net/blog/2016/08/hello-world-about-this-blog/"}]}